const policsT = [
	['精',/j[īi]ng/g],['性',/x[ìi]ng/g],['色',/s[èe]/g],['日',/r[ìi]/g],['十$1八九',/十([有之])﹡﹡/g],['八九不離十','﹡﹡不離十'],
	['$1穴',/([點賊巢虎墓])x/g],
	['性$1',/姓([情別質命])/g],
	['$1興',/([酒])姓/g],
	['$1性',/([屬特天習靈慣本秉雌雄男女養索个血陰陽野心隨惰人藥品寒])姓/g],
	['$1性',/(一次|機動|可能|毀滅|災難|嚴重|[威恐]嚇)姓/g],
	['性$1',/姓(本善)/g],
	['國軍$1',/﹡﹡([人事隊])/g],
];

/**
 * OCR 文本常見錯誤
 */
const correctOcrT = [
	['日$1',/曰(積月累|用常行|增月益|充月盈|充月盛|增月長|就月將|變月化|新月盛|徵月邁)/g],
	['$1日$2夜',/([一二三四五六七八九十])曰([一二三四五六七八九十])夜/g],
	['$1日',/([彌經歷][一二三四五六七八九十]+)曰/g],
	['$1曰',/([老莊孔孟孫]子)日/g],
	['$1曰',/(紫陽|眞人|眞君)日/g],
	['$1曰',/([》詩問答注註名號上下左右亦師始人物豈語稱])日/g],
	['$1曰',/([經故𨿽乃])日/g],  //根據語境會有錯誤
	['是曰$1',/是日(.{0,4}[也﹐。])/g],
	['曰$1',/日([﹕生死])/g],
	['則曰自然',/則日自然/g],
	['$1曰$2',/([一二三四五六七八九十])日(.{2,2}司)/g],
	['東$1',/束(.?[南西北])/g],
	['東$1',/束([翁祖周日方海行])/g],
	['$1東',/([從南西北])束/g],
	['無$1',/元([道外端偏象欲滯窮諸處物狀所爲求名生死進退染垢事由兆極期心言聞問答應視聽說由形色聲])/g],
	['無$1',/元(不爲|修學|分別|以出聲|其實|思慮|今古|正可正)/g],
	['$1無',/([虛])元/g],
	['$1無',/(以有|有物之|欲言其)元/g],
	['無$1',/元([而能生化或]*有)/g],
	['$1無',/(有[而或]+)元/g],
	['有無$1',/有元([^气炁氣精精神])/g],
	///['無$1',/元([﹐])/g],['元$1',/無(.?根本也)/g],
	['內無自性',/內元自性/g],
	['其無也',/其元也/g],
	['間$1',/問([隔])/g],
	///['$1間',/(之|天地)問/g],
	['$1間',/([^有]人)問/g],
	['尾閭',/尾[閒閑]/g],
	['宮商角徵羽',/官商角徵羽/g],
	['橐籥',/[棄崇]籥/g],
	['無極',/元極/g],
//	['$1谷',/([不])[轂穀]/g],
	['千$1',/[干幹乾](山萬水|思萬慮|言萬語|變萬化|奇百怪|方百計)/g],
	['$1千萬',/([一二三四五六七八九十百千])[干幹乾]萬/g],
	['表裏',/表裹/g],
	['戌亥',/戍亥/g],
	['己丑',/[已][醜]/g],
	['己$1',/已([意])/g],
	['左右逢源',/左右逢原/g],
	['$1瀆',/([決河])讀/g],
	['倉稟',/倉凜/g],
	['$1免',/([難不避以赦減])兔/g],
	['旁$1',/傍([道門])/g],
	['輪回',/輸回/g],
//	['$1干',/([闌欄])[幹榦乾杆]/g],
	['幾番$1',/幾翻([^傾覆臉新車案供頭浪])/g],
	['$1鐘',/([秒鼓銅])鍾/g],
	['鐘$1',/鍾([磬])/g],
	['時鍾$1',/時鐘([^停畱留在擺放由以預設制被是置應用機構造影鍍塗響鼓磬聲的。﹑﹐﹔﹕])/g],
	['鍾離權',/鐘離權/g],
	['道炁',/道熙/g],
	['朱裏汞',/朱裹汞/g],
	['掐$1訣',/拾(.{0,2})訣/g],
	['不學無術',/不學無朮/g],
	'采釆',

];


/**
 * 給古文加標點
 */
const dotT = [
	['$1﹕$2',/([曰])([^﹕。])/g],
	['$1﹕$2',/(者)﹐([^也])/g],
	['$1。$2',/([哉矣乎也])([^。])/g],

];


/**
 * 異體字比較傾向使用左右結構取代上下結構的，因左右結構的字體的筆畫間距較大，較容易識別。待議。此選擇僅爲个人傾向。
 */
const traAdjustT = [
	///个人傾向采用的簡化形 --begin--
	'网網','气氣','个個箇','艸艹草',
	///个人傾向采用的簡化形 --end--

	'峯峰','羣群',  //个人比較傾向使用左右結構的，因爲比較清晰。但小篆只有上下結構的
	'略畧',
	'脇脅胁','胸胷','魂䰟','期朞','裏裡',
	'祕秘','尢尤','欲慾','淫婬','獘弊',
	'迹跡','徧遍',
	'柰奈','㮏㮈','渿㴎',  //捺
	'眾衆众','𨿽雖虽',
	'陰隂阴','壽夀寿','乘椉𠓲乗',
	'彊強强','𨯞䥒','𠣃𠣀勥','𧟂襁',  //'強𧖑','犟𠎦',
	'敲毃㪣','敍敘叙',
	'衮袞','滚滾','磙𥕦',
	'兌兊兑','說説说','兗兖','涗涚',
	'監监','鑑鑒鍳鉴','覽览','艦舰',
	'兪𠉽俞','偸偷','諭谕喩喻','楡榆',  //輸
	'盍盇','溘𣹆','蓋葢盖','闔𨵵阖','嗑㗐','磕𥔐','𡏖𡎌',
	'靑青','精精','靖靖','淸清','瀞瀞','晴晴',
	//'猜',
	'爲為为','僞偽伪','潙溈沩','嬀媯妫',
	'錄録彔录','碌碌','籙箓','祿禄','剝剥',
	'眞真','顚顛颠','愼慎','巓巔巅','鎭鎮镇','塡填','槇槙','鷆鷏',
	'縝缜','闐阗',
	'卽即','節節节','旣既','漑溉','槪槩概','廏廄厩','慨慨','曁暨','喞唧',
	'鄕郷鄉',//《說文解字》似無此字，字形類推而得，中部字形若爲「良」則不宜使用「鄕」，因「良」「皀」不同形
	//'卿',
	'惟唯','兔兎',	'步歩','蒙䝉','卷巻','增増',
	'斂歛敛','幼㓜',
	'贊賛赞','攢攅','讚讃','囋𡂐','鑽鑚',
	'隸𨽻隷隶','兜兠','冒冐',
	'鬭鬬𨷖𩰚𩰛閗鬪𩰑𩰒𩰖𨶜',  //鬥
	'爇𤑔','聰聦聪','叫呌',
	'悞悮','逃迯',
	'派𣲖',
];

///////////誊 字形錯？
const standardT = [
//---个人傾向---begin---

'采採','凶兇','才纔','電电','沖冲','淨凈净浄','決决','涼凉','減减','往徃','卜蔔','徵征','巡廵','恥耻',

'樣様样','溯㴑泝','污汚汙','雜襍雑','焱㷋','麼麽么','廠厰厂','沈沉',

'丘丠','虛虗𧆳𣦄𠧝虚','奇竒','劫刦','冰氷','回囘囬迴',

'並竝傡並𠊧併并','普暜','譜𧭘','戶戸户','啟啓启',

'醯𨣓','玆茲','冬鼕','事亊','渺𣺌','囉啰','捷㨗','覓覔觅','幫幇帮','妝粧妆','爭争','吁籲','玄𢆯','旨㫖𠤔',

'吳呉吴','娛娱','俁俣',

'尙尚','寶寳宝','久乆',

//奉「丵」爲「菐」事「菐」者「僕」

'僕仆',

'畱留','橊榴','㙧塯','鐂鎦镏','澑溜','癅瘤','𨖻遛','𢔲𢕍','𥢋𥠷','㩅㨨','驑騮','飅飀','璢瑠','𥛽𥛅','餾馏','騮骝',

//'熘',

'閒閑闲','間间',

'邊𨘢邉边','你妳','硅矽','碱堿','缽钵','皰疱','效傚俲効','仿倣','咒䛆呪詋','疏踈','怪恠',

'綠绿','緣縁缘','祿禄','櫞橼','淥渌',

'鏹镪','𦇤繈襁',

'靜静','請请',

'僉佥','劍劎劒劔剑','薟莶','險险','殮殓','儉俭','撿捡','鹼礆硷','檢检','襝裣','瞼睑','瀲潋',

'輸输','覦觎',

'歷厯歴历','曆暦',

'參叅𠫵参','驂骖',

'猛勐','煆煅','糊煳','沒没','歿殁',

'漵溆',

'崳嵛',

//'撅','噘','健','徤',

//'渺淼',

//---个人傾向---begin---

//---因爲不識字，畫个叉代替。---begin---最深惡痛絕的

'龍龙','龔龚','龕龛','瀧泷','寵宠','嚨咙','襲袭','蘢茏','曨昽','龐庞','櫳栊','瓏珑','礱砻','籠笼','聾聋','朧胧','隴陇','矓眬','攏拢','壠壟垄垅',

'鳳凤','鄧邓','雙双','變变','疊叠','戲戏','對对','聶聂','鑷镊','灄滠','權权','歡欢','勸劝','艱艰','嘆叹','僅仅','難难','漢汉','灘滩',

'鹵卤','趙赵',

'區区','奩奁','嫗妪','嘔呕','瞘眍','軀躯','謳讴','嶇岖','樞枢','漚沤','摳抠','歐欧',

'岡冈','剛刚','綱纲','鋼钢','崗岗',

'風风','嵐岚','楓枫','諷讽','飆飙','颭飐','颸飔','颯飒','颮飑','颶飓','颼飕','飄飘','飈飚','颻飖','飀飗',

'義义','儀仪','議议','艤舣','蟻蚁',

'齊齐','齋斋','儕侪','劑剂','擠挤','濟济','薺荠','躋跻','霽霁','嚌哜','齏齑',

'喬乔','蕎荞','僑侨',

'緊𦂳紧','堅坚','鰹鲣','豎竖',

'萬万','厲厉','勱劢','勵励','躉趸','蠣蛎','癘疠','礪砺','邁迈',

'儔俦','幬帱','濤涛','疇畴','禱祷','籌筹','譸诪','鑄铸','檮梼','燾焘',

'韋韦','韌韧','韙韪','韜韬','褘袆','圍围','偉伟','違违','禕祎','幃帏','潿涠','煒炜','韝鞴','諱讳','緯纬','韓韩','韞韫','闈闱','韍韨','瑋玮','葦苇',

'會会','儈侩','劊刽','噲哙','澮浍','檜桧','膾脍','薈荟','層层','繪绘','燴烩',

'婁娄','屢屡','髏髅','縷缕','蔞蒌','窶窭','數数','螻蝼','鏤镂','屨屦','僂偻','嶁嵝',

'樂乐','礫砾','濼泺',

'飛飞','關关','憶忆','蠔蚝','鑰钥','講讲','慶庆','養养','擊击','釁衅','襯衬','襪袜','開开','畫画','傑杰','佇伫','洶汹','體体','戰战','藝艺','趕赶','鐘钟','響响','認认','讓让','傭佣','蠶蚕',

'靈灵','欞棂',

//---因爲不識字，畫个叉代替。---end---最深惡痛絕的

'攙搀','鑱镵',

'棗枣',

'盡儘侭尽','藎荩','燼烬',

'潑泼',

'巠𢀖','剄刭','勁劲','徑径','涇泾','痙痉','羥羟','脛胫','莖茎','陘陉','輕轻','頸颈','經经','硜硁','烴烃','氫氢',

'戔戋','棧栈','殘残','淺浅','踐践','箋笺','餞饯','饑飢饥','錢钱','綫線缐线','濺溅',

'嘰叽','機机','璣玑','磯矶','蟣虮','譏讥',

'還还','環环','繯缳','闤阛','鐶镮',

'齒齿','齔龀','齟龃','齙龅','齠龆','齦龈','齬龉','齪龊','齲龋','齷龌','齕龁','齶腭','齗龂','嚙啮',

'農农','儂侬','噥哝','穠秾','濃浓',


'纜缆','欖榄',


'檻槛','濫滥','濫漤','籃篮','藍蓝','襤褴',

'嫵妩','憮怃','撫抚','蕪芜','廡庑',

'賓宾','儐傧','嬪嫔','髕髌','鬢鬓','繽缤','鑌镔','臏膑','殯殡','濱滨','檳槟',

'貞贞','楨桢','湞浈','禎祯','偵侦','幀帧','赬赪',

'貴贵','蕢蒉','匱匮','闠阓','饋馈','繢缋','潰溃','櫃柜',

'賣卖','櫝椟','瀆渎','牘牍','黷黩','贖赎','覿觌','讀读','續续','竇窦',

'頭头','頁页','囂嚣','嶺岺岭','願愿','顯显','煩烦','類类','頂顶','頃顷','項项','順顺','須须','頊顼','頑顽','頓顿','頒颁','頌颂','預预','頗颇','頡颉','頰颊','頜颌','潁颍','頦颏','頷颔','顆颗','題题','顓颛','顙颡','顥颢','顫颤','傾倾','領领','顱颅','顧顾','碩硕','頲颋','熲颎','顒颙','灝灏','頇顸','頎颀','頏颃','頻频','穎颖','顎颚','額额','顬颥','頹颓','顳颞','顢颟','頤颐','顏顔颜','顰颦','顴颧','頴颕','瀕濒',

'賈贾','檟槚','價价',

'鎖鎻锁','嚶嘤','圓圆','嬰婴','實实','惻恻','憤愤','戇戆','摜掼','櫻樱','測测','犢犊','獺獭','瑣𤨏琐','癭瘿','磧碛','蕆蒇','勩勚','鸚鹦','鰂鲗',

'員员','損损','償偿','鄖郧','隕陨','韻韵','勛勋','塤埙','篔筼','殞殒',

'負负','瀨濑','籟籁',

'簾帘',

'臺台','擡抬',

'龜龟','鬮阄',

'黽黾','竈灶','繩绳','黿鼋','蠅蝇','鼉鼍','澠渑',

'畢毕','嗶哔','蓽荜',

'華华','嘩哗','曄晔','鏵铧','樺桦','燁烨',

'覺觉','黌黉','學学','鷽鸴','澩泶',

'譽誉','舉举','嚳喾','櫸榉',

'孌娈','巒峦','彎弯','攣挛','欒栾','蠻蛮','鸞鸾','鑾銮','孿孪',

'覷觑','覥觍',

'呂吕','侶侣','宮宫','閭闾',

'高髙','縞缟','鎬镐',

'專专','傳传','團团','摶抟','轉转',

'蘭兰','闌阑','瀾澜','煉炼','諫谏','讕谰','斕斓','鑭镧','欄栏','爛烂',

'練练','揀拣',

'達达','闥闼','躂跶','薘荙','撻挞',

'國国','幗帼','蟈蝈',

'麥麦','麩麸','麯麴','嘜唛',

'冊册','刪删','姍姗','柵栅',

'侖仑','倫伦','掄抡','淪沦','輪轮','論论','諞谝','綸纶','編编','圇囵',

'倉仓','艙舱','傖伧','創创','嗆呛','瑲玱','滄沧','愴怆','搶抢','熗炝',

'長长','倀伥','帳帐','張张','悵怅','棖枨','萇苌','漲涨',


'爾尔','禰祢','邇迩',

'盧卢','廬庐','鑪爐炉','壚垆','櫨栌','瀘泸','癰痈','臚胪','艫舻','驢驴','蘆芦','轤轳',

'懷懐怀','算筭','德徳','親亲','壞坏','寬宽','屬属','懼惧','攪搅','櫬榇',

'瓊琼','眥眦','髖髋','鰥鳏',

'見见','觀观','規规','視视','覘觇','覬觊','覡觋','覯觏','覲觐','俔伣','靚靓','靦腼','莧苋','硯砚','窺窥','蜆蚬','梘枧','筧笕','峴岘',

'觸触','燭烛','獨独','濁浊',

'譯译','繹绎','鐸铎','澤泽','嶧峄','懌怿','擇择','釋释',

'謾谩','鰻鳗',

'殲歼','讖谶','纖纤',

'幟帜','熾炽','職职','織织','識识',

'鳥鸟','蔦茑','窵窎','鳩鸠','鳴鸣','鴇鸨','鴆鸩','鴣鸪','鴨鸭','鴦鸯','鴝鸲','鴛鸳','鷙鸷','鴿鸽','鴻鸿','鵠鹄','鵒鹆','鶻鹘','鶩鹜','鶴鹤','鷓鹧','鷯鹩','鷸鹬','鷺鹭','鶬鸧','鴞鸮','鵃鸼','鷫鹔','鶡鹖','鸇鹯','鷖鹥','鳶鸢','鷗鸥','鴉鸦','鶇鸫','鸕鸬','鴟鸱','鴕鸵','鷥鸶','鴯鸸','鴰鸹','鵂鸺','鵓鹁','鸝鹂','鵑鹃','鵝鹅','鷴鹇','鵜鹈','鵡鹉','鵲鹊','鶓鹋','鵪鹌','鵯鹎','鵬鹏','鶉鹑','鶘鹕','鶚鹗','鶿鹚','鶥鹛','鷂鹞','鶼鹣','鷚鹨','鷦鹪','鷲鹫','鷹鹰','鸌鹱','鸛鹳','鳲鸤','鴒鸰','鴴鸻','鵐鹀','鵾鹍','鵮鹐','鶊鹒','鵷鹓','鶖鹙','鷊鹝','鶲鹟','鶹鹠','鶺鹡','鷁鹢','鸏鹲','鸘鹴',

'鳧凫','島岛','裊袅','梟枭',

'烏乌','鄔邬','嗚呜','塢坞','鎢钨',

'馬马','驫骉','驚惊','騰腾','驀蓦','禡祃','馱驮','馴驯','馳驰','驅驱','駁驳','駟驷','駙驸','駒驹','駐驻','駕驾','駘骀','驍骁','驕骄','駱骆','駭骇','駢骈','驪骊','騁骋','驗騐验','駿骏','騏骐','騎骑','騅骓','騷骚','騖骛','驄骢','驥骥','馹驲','駰骃','騤骙','驤骧','馮冯','篤笃','馭驭','駔驵','駛驶','駝驼','駑驽','驛驿','罵骂','驊骅','騍骒','騙骗','驁骜','騸骟','驃骠','騾骡','驏骣','驟骤','騂骍','駸骎','騌骔','驌骕','驦骦','嗎吗','騭骘','騫骞','榪杩',

'闖闯',

'魚鱼','魴鲂','鮁鲅','鮎鲇','鮒鲋','鮑鲍','鮐鲐','鮚鲒','鮪鲔','鮞鲕','鮫鲛','鮮鲜','鱺鲡','鰱鲢','鯉鲤','鯀鲧','鯇鲩','鯫鲰','鯢鲵','鯛鲷','鰈鲽','鰒鳆','鰨鳎','鰩鳐','鱅鳙','鱖鳜','鱒鳟','鱧鳢','鮊鲌','鮍鲏','鮦鲖','鯕鲯','鱨鲿','鰜鳒','鰼鳛','鱣鳣','薊蓟','魷鱿','魯鲁','鮃鲆','鱸鲈','鱟鲎','鮭鲑','鱭鲚','鱘鲟','鯁鲠','鰣鲥','鰷鲦','鯊鲨','鯽鲫','鯖鲭','鯪鲮','鯡鲱','鯤鲲','鯧鲳','鯝鲴','鯰鲶','鯨鲸','鯴鲺','鯔鲻','鱝鲼','鰓鳃','鱷鳄','鰍鳅','鰉鳇','鯿鳊','鰠鳋','鰲鳌','鰭鳍','鰳鳓','鰾鳔','鱈鳕','鱉鳖','鰵鳘','鱔鳝','鱗鳞','魛鱽','魨鲀','䰾鲃','魺鲄','鮋鲉','鮓鲊','鮜鲘','鱠鲙','鮶鲪','鯒鲬','鰺鲹','鰏鲾','鯷鳀','鰮鳁','鰟鳑','䲁鳚','漁渔','鯗鲞','鰌','櫓橹','癬癣','穌稣','蘇苏','氌氇',

'喫吃','辧辨','劃划','剴剀','劇剧','劈噼','潔洁','瀏浏','鞀鼗','詔诏','紛纷','紹绍','鍥锲',

'謚谥','謐谧',

'喪丧','獸兽','嶽岳','撚捻','狀状','獷犷','猶犹','獄狱','獫猃','獵猎','獻献','獲获','蕕莸',

'厭厌','壓压','黶黡','靨靥','魘魇','厴厣','饜餍',

'虫蟲','蠱蛊','蝦虾','蛺蛱','蛻蜕','蝸蜗','虯虬','蟺蟮',

'羅罗','蘿萝','邏逻','欏椤',

'迥逈','遁遯','䢐徂','導导','遼辽','過过','進进','遲迟','遜逊','遞递','邐逦','瘲疭','迆迤',

'廣广','廝厮','纊纩','壙圹','曠旷','鄺邝',

'廈厦','廟庙','纏缠','廚厨','廂厢',

'巖岩','嚴严','儼俨',

'櫪枥','瀝沥','膽胆','釐厘','滻浐','犛牦','詭诡','諺谚','鏟铲',

'禦御','禮礼','禍祸','際际','綜综',

'耽躭','沈沉','禿秃','兒儿',

'堯尧','僥侥','蕘荛','繞绕','嘵哓','嬈娆','撓挠','曉晓','橈桡','澆浇','燒烧','磽硗','翹翘','饒饶','鐃铙',

'勢势','褻亵','熱热',

'況况',

'稅税','脫脱','銳锐',

'陸陆','統统','餕馂','銑铣',

'優优','愾忾','態态','懟怼','懇恳','惡恶','慟恸','愷恺','愨悫','慘惨','懲惩','懾慑','怵憷','懣懑','穩稳','蔥葱','慮虑','隱隐',

'貍狸','貓猫',

'竄窜',

'犧牺','絆绊',

'噓嘘','據据','虜虏',

'晚晩','冤𡨚',

'窯窑',

'瀦潴','豬猪','櫫橥',

'隊队','墜坠',

'麗丽','儷俪','曬晒','灑洒','酈郦','釃酾',

'塗涂','渙涣','滌涤','煥焕','畬畲','膠胶','郟郏','陜陕','給给','絕絶绝','綹绺','繆缪','儺傩','齡龄','餘馀','飾饰','餅饼','鏐镠','鈴铃','銼锉','鏃镞','鏇镟','鋏铗','儻傥','傴伛',

'吞呑','咽嚥','墊垫','墊埝','摯挚','蟄蛰','雞鸡','絝绔','綺绮','饁馌','錡锜',

'攜携','攤摊','匯汇','濰潍','離离','蘺蓠','躍跃',

'園园','補补','襖袄','裝装','釀酿','縗缞','鑲镶','褸褛',

'館舘','饗飨','飪饪','飯饭','飽饱','飴饴','餉饷','館馆','饉馑','餈糍',

'稟禀','檁檩',

'稈秆','種种','稱称','稭秸','縑缣',

'翻飜','鑿凿','瀋渖','燦灿','糧粮','綣绻',

'塏垲','樹树','皚皑','磑硙','鐙镫','鎧铠',

'動动','壘垒',

'當当','鐺铛','璫珰','襠裆','檔档',

'腫肿',

'單单','癉瘅','觶觯','撣掸','殫殚','嘽啴','簞箪','嬋婵','彈弹','蘄蕲','鄲郸','嚲亸','囅冁','闡阐','禪禅','蟬蝉','憚惮',

'竅窍',

'黨党','讜谠','钂鎲镋',

'寫写','瀉泻',

'綢绸','鏞镛',

'撥拨','廢废','醱酦',

'醫医','擬拟','癡痴','矯矫','礙碍',

'務务',

'櫛栉','混溷','階阶','紕纰','緄绲','齜龇','鍇锴',

'與与','興兴','嶼屿','樁桩','歟欤',

'搖摇','搖摇','遙遥',

'微㣲','聲声','毆殴','澱淀','鎩铩',

'婦妇','幣币','帥帅','鄴邺',

'鞏巩',

'翽翙','緹缇','歲𡻕岁','噦哕','劌刿',

'趨趋','騶驺','雛雏','謅诌',

'牀床','札劄','朴樸','湊凑','嶸嵘','極极','構构','槍枪','檉柽','棟栋','櫟栎','橋桥','樓楼','礎础',

'苟芶','茲兹','淒凄','淩凌','莊庄','瀟潇','簍篓','薌芗','芐苄','蒼苍','蕁荨','蓀荪','蔭荫','藥药','萊莱','蒔莳','蕭萧','蔣蒋','薔蔷','藪薮','鄒邹','暱昵','縐绉','綾绫','縭缡','鏌镆',

'箏筝','簫箫','箄箅',

'嘮唠','澇涝','滅灭','煬炀','爍烁','煙烟','癆痨','瑩莹',

'壇坛','堊垩','塒埘','屆届','溝沟','郵邮',

'釾','鍼針','銜衔','鈒钑','銍铚','銛铦','鎛镈','釘钉','釬钎','釵钗','鉅钜','鈍钝','鈔钞','鈐钤','欽钦','鈞钧','鈁钫','鈕钮','鈀钯','鉗钳','鉆钻','鑠铄','鉛铅','鉉铉','銅铜','鋌铤','銓铨','銚铫','鉻铬','銘铭','鋪铺','銷销','鋝锊','銻锑','鋃锒','錯错','錫锡','錮锢','鍵键','鋸锯','鍛锻','鍰锾','錚铮','鉤钩','錏铔','鍼针','鉞钺',

'玨珏',

'陽阳','碭砀','湯汤','場场','餳饧','觴觞','鍚钖','鐋铴','颺飏','楊杨','暢畅','殤殇','燙烫',


'淵渊',

'繡绣',

'尋寻','潯浔','滲渗','滿满',

'術术',

'靉叆','謔嚯','布佈','癟瘪','癇癎痫',

'帶带','滯滞',

'冥㝠','煮煑','奼姹','答荅','準准','異异','弔吊','瘻瘺','業业','叢丛','東东','丟丢','爿丬','臨临','習习','鄉乡','書书','亂乱','虧亏','亙亘',

'亞亚','氬氩','椏桠',

'產産产',

'從从','樅枞',

'夥伙','億亿','畝亩',

'傘伞','傷伤','側侧','倆俩','傯偬','內内','吶呐','凍冻','凜凛','憑凭','凱凯','氹凼','芻刍','劉刘','別别','剎刹','辦办','勞劳','勻匀','匭匦','協协','臥卧','衛卫','卻却','巹卺','廳厅','縣县','號号','嚇吓','唚吣','噸吨','聽听','嘸呒','囈呓','嚦呖','嚀咛','噝咝','噅咴','啞哑','噠哒',

'嗇啬','檣樯',

'囀啭','嘯啸','餵喂','嘍喽','囁嗫','噯嗳','囑嘱','嚕噜','囪囱','圖图','聖圣','阪坂','塊块','壢坜','壩坝','墳坟','墾垦','坰垧','埡垭','堖垴','堝埚','垵埯','墮堕','墑墒','墻墙','壯壮','殼壳','壺壶',

'處处','備备','夠够','奪夺','奮奋','獎奖','奧奥',

'媽妈','婭娅','嬌娇','嫻娴','嬸婶','嬡嫒','嬙嫱','嬤嬷','孫孙',

'寧宁','寧甯','濘泞','檸柠',

'審审','憲宪',

'寢寝',

'將将','槳桨','漿浆',

'塵尘','嘗尝','尷尴','屜屉','豈岂','嶴岙','崠岽','巋岿','峽峡','嶠峤','崢峥','嶗崂','崍崃','嶄崭','脊嵴','巰巯','師师','冪幂','襆幞',

'應应','廩廪','異异','棄弃','弒弑','彌弥','弳弪','歸归','彜彝','彥彦','徹彻',

'懺忏','憂忧','慫怂','慪怄','憐怜','總搃总','戀恋','懨恹','惱恼','悅悦','懸悬','慳悭','憫悯','憊惫','愜惬','慚惭','慣惯','湣愍','楞愣','懶懒','懍懔','戧戗','紮扎','撲扑','扡扦','執执','擴扩','掃扫','揚扬','擾扰','拋抛','報报','擔担','擁拥','攔拦','擰拧','掛挂','撾挝','擋挡','撟挢','掙挣','揮挥','撈捞','搗捣','擄掳','摑掴','擲掷','摻掺','摣揸','攬揽','撳揿','擱搁','摟搂','攝摄','攄摅','擺摆','擯摈','攖撄','撐撑','攆撵','擷撷','擼撸','攛撺','搟擀','擻擞','攢攒','敵敌','斷断','無无','舊旧','時时',

'曇昙','晝昼','殺杀','雜杂','桿杆','條条',

'晉晋','戩戬',

'來来','倈俫','徠徕','睞睐','淶涞',


'愛爱','曖暧',

'梔栀','標标','棲栖','棬桊','榿桤','夢梦','槨椁','橢椭','橰槔','櫥橱','毀毁','斃毙','氈毡','毿毵','灃沣','滬沪','淚泪','窪洼','湧涌','澀涩','漬渍','灣湾','濕湿','灩滟','濾滤','潛潜','燈灯','災灾','燉炖','點点','灤滦',

'爺爷','牽牵','獁犸','狽狈','麅狍','獰狞','狹狭','獅狮','獪狯','猙狰','猻狲','獼猕','玀猡','瑪玛','現现','璽玺','瑉珉','琺珐','琿珲','瑯琅','璉琏','瑤瑶','璦瑷','瓔璎','瓚瓒','甕瓮','甌瓯',

'癤疖','療疗','瘧疟','瘍疡','癧疬','瘡疮','瘋疯','屙疴','癥症','癢痒','瘂痖','瘓痪','癇痫','瘞瘗','瘻瘘','癱瘫','癮瘾','癩癞','癲癫','臒癯','臯皋','皺皱','盞盏','鹽盐','盜盗','盤盘','瞇眯','著着','睜睁','脧睃','睪睾','瞞瞒','矚瞩','礬矾','礦矿','碼码','磚砖','硨砗','碸砜','硤硖','確确','磣碜','積积','穢秽','穭稆','穡穑','窮穷','竊窃','窩窝',

'筍笋',

'筆笔','潷滗',

'籩笾','築筑','篳筚','篩筛','簽签','簡简','簀箦','篋箧','籜箨','籮箩','簣篑','籬篱','籪簖','糴籴','秈籼','糶粜','糲粝','粵粤','糞粪','糝糁','縶絷','罰罚','罷罢','羆罴','羈羁','羨羡','翺翱','耮耢','耬耧','聳耸','聹聍','聯联','聵聩','肅肃','腸肠','膚肤','骯肮','膁肷','腎肾','脹胀','勝胜','腖胨','脈脉','臍脐','腦脑','膿脓','臠脔','腳脚','腡脶','臉脸','臘腊','膩腻',



'艷艳',

'羋芈','蕓芸','蓯苁','藶苈','薴苎','蘋苹','範范','繭茧','荊荆','薦荐','莢荚','蕩荡','蕒荬','葒荭','葤荮','蒞莅','蓧莜','萵莴','蒓莼','菇菰',

'螢萤','營营','縈萦','鎣蓥','檾苘','鶯莺','塋茔','煢茕','榮荣','滎荥','熒荧','犖荦','瀅滢','瀠潆',


'薩萨','蕷蓣','蘞蔹','蘊藴蕴','槁藁','蘚藓','蘗蘖','蠆虿','蝕蚀','螞蚂','蟶蛏','蟯蛲','螄蛳','蠐蛴','蠟蜡','蠍蝎','蠑蝾','蟎螨',

'蹌跄','躒跞','蹺跷','蹕跸','躚跹','踴踊','躊踌','蹤踪','躑踯','躡蹑','蹣蹒','躕蹰','躥蹿','躪躏','躦躜','辭辞','遷迁','運运','這这','遠远','疊迭','逕迳','適适','選选','遺遗','鄰隣邻','郤郄','鄶郐','鄭郑','醬酱','釅酽','陳陈','隉陧','隨随','雋隽','靂雳','霧雾','黴霉','韃鞑','鞽鞒','韉鞯','魎魉','鹺鹾',

'黃黄','橫横',

'黲黪','鼴鼹','齇齄','沍冱','剗刬','勗勖','龎厐','叄叁','弔吊','吒咤','啢唡','壋垱','壼壸','奼姹','恆恒','卹恤','戱戯','掗挜','撏挦','惇敦','暘旸','棶梾','箠棰','稜棱','搾榨','汆氽','澦滪','燻熏','蝟猬','瑒玚','痺痹','燐磷','礡礴','簹筜','篛箬','冑胄','虆蔂','薀蕰','螿螀','蠨蟏','蠷蠼','襏袯',

'夾夹','俠侠','浹浃','挾挟',

'奐奂','換换','喚唤',

'兩两','輛辆',

'鬧闹','鬩阋',

'咼呙','剮剐','媧娲','渦涡',


'脈脉','霢霡',

'媼媪','慍愠','溫温','縕缊','醞酝','搵揾','轀辒','榲榅','膃腽','熅煴','氳氲',

'車车','軋轧','軌轨','軒轩','軔轫','轟轰','軻轲','軸轴','軹轵','軼轶','轢轹','軺轺','軾轼','輇辁','輅辂','輔辅','輥辊','輟辍','輻辐','輯辑','轅辕','轄辖','軑轪','輈辀','輬辌','輦辇','輩辈','連连','庫库','鏈链','鏨錾','塹堑','惲恽','斬斩','暫暂','槧椠','轂毂','渾浑','漸渐','皸皲','蓮莲','槤梿','軛轭','軟软','軲轱','軤轷','軫轸','輊轾','轎轿','較较','輒辄','輝辉','輞辋','輳辏','輾辗','轆辘','轍辙','轔辚','陣阵','厙厍','轡辔','褳裢','輿舆','輜辎','褲裤','載载','漣涟',


'軍军','暈晕','暉晖','諢诨','褌裈','葷荤','鄆郓',

'貝贝','賤贱','賢贤','賭赌','僨偾','債债','則则','嘖啧','噴喷','酇酂','賵赗','購购','貯贮',

'質质','躓踬',

'賁贲','豶豮','績绩','賴赖','賾赜','贗赝','贄贽',

'贔赑','財财','責责','敗败','貨货','販贩','貪贪','貧贫','貶贬','貰贳','貼贴','貿贸','費费','賀贺','貽贻','賄贿','貲赀','賃赁','賂赂','資资','賑赈','賦赋','賜赐','貢贡','賞赏','贅赘','賻赙','贈赠','贍赡','纓缨','纘缵','罌罂','廁厕','貫贯','貳贰','貺贶','貸贷','賊贼','賅赅','賕赇','賚赉','賒赊','賫赍','賡赓','賠赔','賧赕','贇赟','賺赚','賽赛','贏赢','贛赣','趲趱','屓屃','唄呗','𨣈𨡺','嗩唢','憒愦','瞶瞆','臢臜','貟贠','賙赒','幘帻','嗊唝','賬账','贐赆','贓赃','買买',

'飠饣','餼饩','饞馋','餱糇',

'餓饿','飣饤','飥饦','餎饹','餏饻','餖饾','餜馃','餺馎','餶馉','飿饳','飩饨','飫饫','飭饬','飲饮','飼饲','餌饵','餃饺','餑饽','餒馁','餛馄','餡馅','餷馇','餿馊','饃馍','饈馐','饅馒','饊馓','饌馔','饢馕','餘馀',

'釒钅','鐫镌','錆锖','鑹镩','鏘锵','鐵铁','鐒铹','錸铼','鍋锅','鋯锆','鑼锣','鐠镨','鈸钹','鈉钠','鋥锃','銫铯','鍺锗','鑊镬','鑥镥','鑕锧','鏗铿','鐨镄',

'鈃钘','鉋铇','鉶铏','鋩铓','鋙铻','錩锠','鍈锳','鍠锽','鎡镃','鏰镚','鑞镴','釓钆','釔钇','釗钊','釙钋','釕钌','釷钍','釧钏','釤钐','釩钒','釣钓','釹钕','鈣钙','鈈钚','鈦钛','鈑钣','鈧钪','鈥钬','鈄钭','鈺钰','鈷钴','鈳钶','鉕钷','鈽钸','鉬钼','鉭钽','鉀钾','鈾铀','鉑铂','鉚铆','鈰铈','鉍铋','鈮铌','鈹铍','銬铐','銠铑','鉺铒','銪铕','鋮铖','鋣铘','鋁铝','銱铞','銦铟','銖铢','銩铥','鉿铪','鉸铰','銥铱','銃铳','銨铵','銀银','銣铷','鋱铽','鋰锂','鋤锄','鋨锇','銹锈','鋒锋','鋅锌','鋶锍','鋟锓','鋦锔','錒锕','鍩锘','錨锚','錛锛','鍀锝','錁锞','錕锟','錘锤','鍁锨','錈锩','鍃锪','錇锫','錳锰','鍶锶','鍔锷','鍬锹','鎪锼','鎄锿','鍍镀','鎂镁','鎇镅','鎘镉','鎳镍','鎿镎','鎊镑','鎰镒','鎵镓','鏢镖','鏍镙','鏑镝','鐔镡','鐝镢','鏷镤','鐓镦','鐳镭','鐮镰','鐿镱','鑔镲','鍘铡','鋇钡','鐦锎','鐧锏','鍆钔','鍤锸','鏝镘','鐲镯','錐锥','鎔镕','錠锭','鏜镗','錙锱','鉦钲','鉈铊','鈿钿','鍾锺','錦锦','錟锬','鐐镣','鏡镜','鑣镳',

'門门','闓闿','闒阘','闍阇','閱阅',

'閃闪','閉闭','問问','閏闰','閎闳','閌闶','悶闷','聞闻','閩闽','閥阀','閣阁','閡阂','閬阆','閾阈','閹阉','閶阊','閽阍','閻𨶒阎','閼阏','闃阒','闋阕','闕阙','捫扪','潤润','藺蔺','誾訚','閂闩','閆闫','閔闵','閘闸','閨闺','閫阃','閿阌','闊阔','闞阚','閈闬','襇裥','們们','澗涧','燜焖','櫚榈',


'糸纟','絲丝','紵纻','韁缰','繼继','縱纵','紱绂','纈缬','緔绱','繒缯','縉缙','緒绪',

'糾纠','紆纡','紅红','紂纣','紇纥','約约','級级','紀纪','紉纫','紜纭','純纯','紗纱','納纳','紙纸','紋纹','紡纺','紐纽','紓纾','紺绀','紲绁','組组','紳绅','細细','終终','紼绋','絀绌','紿绐','綁绑','絨绒','結结','絎绗','絢绚','絳绛','絡络','絞绞','綆绠','綃绡','綏绥','絳绦','綈绨','緋绯','綽绰','維维','綿绵','綬绶','繃绷','綻绽','綴缀','緙缂','緘缄','緬缅','緲缈','緝缉','緦缌','綞缍','緞缎','緶缏','緱缑','緩缓','締缔','緡缗','縛缚','縟缛','縊缢','縲缧','縮缩','繾缱','繳缴','紘纮','紝纴','絰绖','綌绤','緓绬','綯绹','喲哟','辮辫','紈纨','絹绢','紖纼','縹缥','緗缃','縵缦','綰绾','繕缮','緇缁','繅缫','繰缲','繚缭','縋缒','縫缝',


'櫧槠',

'訁讠','謄誊','誇夸','證证','讒谗','諍诤','誄诔','譖谮','譜谱','讞谳','詡诩','誤误','誥诰','諸诸','護护','競竞','謠谣','謹谨','譾谫',

'訃讣','訖讫','許许','訛讹','評评','訴诉','診诊','誆诓','詼诙','話话','詫诧','誚诮','誘诱','誑诳','諑诼','諂谄','諄谆','誼谊','謊谎','謔谑','謂谓','諤谔','諮谘','謖谡','謝谢','謫谪','譚谭','譴谴','譫谵','訩讻','詠咏','藹蔼','靄霭','計计','訂订','訐讦','訌讧','討讨','訕讪','訓训','訊讯','記记','詎讵','訝讶','訥讷','訟讼','設设','訪访','訣诀','詁诂','訶诃','詛诅','詐诈','詆诋','詞词','詘诎','詒诒','試试','詿诖','詩诗','詰诘','誠诚','誅诛','詵诜','誕诞','詬诟','詮诠','詢询','詣诣','該该','詳详','誣诬','語语','誨诲','誦诵','誒诶','諏诹','諾诺','誹诽','課课','諉诿','諛谀','誰谁','諗谂','調调','諒谅','誶谇','談谈','謀谋','諶谌','諜谍','諧谐','謁谒','諼谖','諳谙','諦谛','謨谟','謗谤','謙谦','謬谬','譙谯','譎谲','託讬','訒讱','詗诇','詖诐','諝谞','儲储','讎雠','辯辩','誡诫','謎谜','滸浒',


];

//console.log(standardT.length);


const daoistDefT = [
	['炁穴',/[氣气]穴/g],
	['$1炁',/([元道靈祖梵])[氣气]/g],
	///['祖炁$1',/祖[氣气]([^平沮傑象得往])/g],  //元始祖炁
	/**
	['$1炁',/(虛無[之一]{1,2})气/g],
	['$1炁',/(先天[之一]{0,2})气/g],
	['受炁$1',/受气(成形|之初)/g],
	['道貫三才爲一炁',/道貫三才爲一气/g],
	['虛無生一炁',/虛無生一气/g],['一炁產陰陽',/一气產陰陽/g],['一炁之妙',/一气之妙/g],['一炁分眞',/一气分眞/g],
	['$1炁',/((天地|陰陽|祖劫)[一之])气/g],
	//*/
	['$1炁',/(虛無[空之一]{1,2})气/g],
	['$1炁',/(一之?)气/g],
	['以炁$1',/以气(相召|而靈)/g],['$1以炁',/([天地]|陰陽|風雷|人身|道法)以气/g],['炁之在彼',/气之在彼/g],
	['神入炁成胎',/神入气成胎/g],['炁歸神結丹',/气歸神結丹/g],
	['炁足眞胎養',/气足眞胎養/g],['炁伏與仙期',/气伏與仙期/g],['固炁成丹',/固气成丹/g],
	['$1交姤',/(坎離|水火|乾坤|龍虎)交媾/g],
	['交姤$1',/交媾(坎離|水火|乾坤|龍虎)/g],
	['炁$1',/气(.?眞)/g],
	['$1干',/([不相莫難])[幹]/g],

	['$1气',/(呼吸|先後二)炁/g],
];

/**
「炁」：丹道用字，專指先天。采樣自《承道集》《道法會元》《鍾呂傳道集》《靈寶畢法》《九層煉心》《唱道眞言》《道德經眞義》《樂育堂語錄》
 */
const daoistToken = [
	//'炁化','炁質','炁質不能相交',修性徒煉炁質之性

	'炁化','集炁成勇','心之充塞爲炁','炁得神而融','要知此炁','眞陰之炁','坎下動炁','賦之以炁','氤氳活動之炁','气方是元炁','以炁爲外爐','繼以炁爲內鼎','此炁一伏','炁貫于穆','氤氳之炁','炁不下墮','外不遣言語應酬而洩炁','炁之實與不實','炁不累贅','炁周神外','只是此炁充滿一身內外','炁歸神','少陽之炁','炁卽神','神卽炁','吾身之炁','卽精卽炁卽神','此炁卽與天地相通','神也炁也','而發爲炁','炁則無時不運而無地不充者','壹炁凝神','炁之養極其粹','鉛卽炁','液炁相生','不與炁交','此炁渾于于穆','此炁卽落于父精母血',

	'物卽炁','炁卽陽','務令此炁日充月盛','此炁已爲之動','陰盡化爲炁',

	'炁有餘妍','炁時歸于爐內','炁爲心使','天地淸和之炁','淸空之虛之炁','一陽之炁','不知有炁','流行之炁','神冥炁合','神凝炁中','炁包神外','我之炁通乎天之炁','天之炁入于我之炁','藥炁','心安炁和','一元淸淨之炁','春炁','夏炁','秋炁','冬炁','炁常定','出炁爲玄','入炁爲牝','此炁不是外來之炁','以神調炁','以炁凝神','今爲諸子再言炁','炁足','炁何在','此炁卽腎間動炁','先天淳朴之炁','至眞之炁','淸空之炁','一陰之炁','一陽之炁','炁貫太和之天','炁歸元海','性爲炁體﹐炁爲性用','神未入炁','炁未歸神','腎間動炁','炁自化','所謂炁者','靜則爲炁','炁存則人存','炁亡則人亡','炁之所關非細故也','炁之衰旺','于炁是賴','志以帥炁','炁以成義','無是炁','惟有此炁','炁未動','炁偶露','炁入神中','神包炁外','炁合于漠','炁由積累','得其炁者成命','其炁之屈而伸也','其炁之伸而屈也','得天地之始炁以爲炁','理可統炁','炁自爲炁','炁𨿽猶是','炁亦因之餒','炁有所歸','炁不妄動','炁因神遷','神歸炁伏','以炁之精爽爲心','炁與心是二而一','認得此炁眞','采得此炁實','伏其炁','活潑蓬勃之炁','神不入炁','炁不伏神','炁了炁','流通活潑者炁','炁產運行','神未與炁交','炁未與神合','氤氳活潑之炁','必于此炁認得淸','炁之發育無疆','炁之充塞無間','炁之歸藏無迹','炁之流行','炁之神化','是炁也','炁回于中宮','此炁長放光明','炁閒神安',

	'淸靈之炁','此炁乃空中虛無元炁','同炁相求','聽炁','母之炁','地之炁','炁之入神','見神而不見炁','此炁卽太和之炁','煉形爲炁',

	'㘞炁','一之炁','一元之炁','一名炁海','一呪一炁','一寸之炁','一息之炁','一意歸中炁','一曜之炁','一炁','一炁一訣','一炁一遍','一炁七','一炁三','一炁中不復失吾意','一炁之妙','一炁之所化','一炁之瓊章','一炁之祕','一炁之祖','一炁之聚散','一炁之變動','一炁之運','一炁之靈','一炁九','一炁二十','一炁使者','一炁兆形','一炁先爲主','一炁具身名曰道','一炁冲和','一炁分眞','一炁初分','一炁參同玄妙','一炁合中央','一炁吸來便見元帥','一炁周流','一炁回春','一炁在乎全','一炁大梵','一炁念','一炁成眞','一炁成符','一炁所生','一炁掌令','一炁散之爲五雷','一炁旣分','一炁昭回','一炁朝元','一炁梵天','一炁流通','一炁火雷使者','一炁爲陰陽之祖宗','一炁生一炁遞','一炁生三','一炁生萬物','一炁相感','一炁相關','一炁章二十一','一炁節制','一炁至','一炁行令','一炁轉洪鈞合','一炁運令','一炁運十二炁','一炁運行','一炁都大雷王','一炁都督雷府','一炁順逆','一炁鴻濛','一炁默念二十','一煉成一炁','一者炁也','一身之炁','一身凡胎之炁','一身精炁','一點光炁大如黍米','七炁','三光之炁','三光炁','三十六炁','三千上炁','三境緫炁','三天之正炁號曰雷霆','三天之炁','三天炁和','三才之炁','三次走炁而書符','三淸本乎一炁','三淸炁滿','三炁','三焦碧炁','三田之炁','三田炁滿','三色之炁','三色炁','三魂隨炁','上下炁','上元生炁','上相一炁眞人','不以炁動心','不可出炁','不可謂炁化之卽太虛','不思存本炁','不明此炁何足有天將之法','不服仍吹炁于左右腿','不正之炁','不祥之炁','不誦呪不作炁','不識炁','丑方炁','丑炁','中和之炁','中天炁','中央土宿總炁','中央炁','中宫炁','中斗大魁之炁','中正之炁','中炁','中靈之炁','中黃之炁','丹炁','丹田之炁','丹田炁','丹碧之炁','丹霄之炁','主炁將','乃微微出炁爲此一遍','久定結炁歸諸本炁','之正炁','乖炁','乘云馭炁','乘此超化炁者召役雷','乘炁','乘炁出入','乘風馭炁','九天之炁','九宮之炁','九幽靈炁','九星光炁','九泉之炁','九炁','九皇正炁','九脉之炁','九色之炁','九色光炁','九芒炁','九陽生炁','九霄炁','乾元之炁','乾元亨正炁','乾元亨震炁','乾元正炁','乾坤之中炁','乾坤之淸炁','乾坤淸炁','亂神自耗炁','二十八宿炁','二十四炁','二卽炁','二星之炁','二炁','于䄂中吸炁一口吞下','云炁','云煙之炁','云隨炁散','云霞之炁','五嶽之炁','五嶽炁','五方之炁','五方兇炁','五方各色炁','五方旺炁','五方正炁','五方炁','五方生炁','五方龍炁','五毒之炁','五炁','五炁之精','五炁俱通','五炁雙雷局','五臟中炁','五臟之炁','五臟炁','五臟色炁','五色之炁','五色光炁','五色炁','五色錦炁','五藏中炁','五藏之炁','五行之炁','五行正炁','五行諸炁','五行順其炁','五雷尊炁','五雷生炁','五靈之炁','亢陽之炁','亥炁','亶兀一炁','人之一炁','人之炁液','人之炁順','人物無此炁','人身之炁以類感類','人身以炁而呼吸','人非此炁不能生','仙家所煉之炁','令取中天炁','令此炁同歸赤子','令炁無所容','令耳中炁作聲爲雷','以上炁呼出','以五爲盈炁','以合前炁','以吾之精神融會一炁之精神','以太極育其炁','以尅制炁加之','以心使炁','以心役炁','以心火炁呵出衝散','以心運諸炁','以我之炁','以我之炁合彼之炁','以我之炁返彼之炁','以放毒炁侵害生人','以此炁采之','以火炁下射河魁','以炁一吸','以炁入室','以炁化神','以炁召神','以炁合炁','以炁合神','以炁吹之','以炁吹布關鎻','以炁存神','以炁布之','以炁感動','以炁成神','以炁招炁','以炁攝','以炁煉炁','以炁爲主','以炁爲母','以炁爲神','以炁爲靈','以炁相召','以炁而論','以炁而靈','以炁足爲國富','以炁足而進之以陽','以炁養形','以炁養神','以爲炁耶','以神不以炁','以神煉炁','以神降而候炁','以神馭炁','以精化炁','以鼻吸本炁','以鼻引淸炁','仰收其炁','任炁自然','伏土炁','伏炁','伏藏此炁','伺炁無容','何以謂之炁','何益于炁','何神何炁何精','作受炁','使炁復還于中丹','促炁','促炁功曹','促炁歸玄關','保守正炁','保扶正炁','保炁','俟其炁','借炁進火','假地炁以成骨肉','假水炁以成涕唾','假火炁以成熱温','假炁成形','偵炁于動','催炁卯','傳炁衰旺','元始一炁','元始之炁','元始化炁','元始混炁','元炁','元白之炁','元皇正炁','元神不完元炁短','元神正炁聚于一符','元陽之炁','元陽即炁','先天一元之炁','先天一炁','先天一炁洪濛未判','先天之母炁','先天之淸炁','先天之炁','先天柔弱之炁','先天淸炁','先天炁','先天無上一炁','先天自一炁以分眞','光明炁','光炁','光芒之炁','兌炁','兒是炁','入泥丸而歸炁','全炁之隆曰神','全炁者全神炁也','兩腎中精炁神左爲日','兩腎之炁','八方之炁','八方正炁','八炁','八邪之炁','六星之炁','六炁','其實有炁','其水與炁','其炁上蒸','其炁上騰','其炁五行俱合','其炁凛然','其炁則爲坤','其炁化作一神','其炁吹噓','其炁在心','其炁均平','其炁如旋風狀','其炁如玉','其炁如絲','其炁寒','其炁小','其炁小而炎','其炁從鼻孔出','其炁才起','其炁最柔','其炁柔脆','其炁無形','其炁玄','其炁甚迅','其炁白','其炁相交','其炁相貫','其炁紅','其炁自住','其炁自四肢毛竅出','其炁自見','其炁自轉','其炁至嫩','其炁隨陰下降','其炁靄然吸之','其炁靑','其炁黄','其老之炁','内外之炁','内外皆爲炁','内炁不出外炁不入','内炁與外炁合','再吸淸炁直衝','冤仇牽債纏染等炁','冤沖妙炁','冤炁','冲炁之内','冲炁交纏','冲炁以和而炁自眞','冲融之炁','冷炁虩出灌筆','冷然炁映','减炁調息','凝神入炁','凝神化炁','凝神定炁','凝神聚炁','凡人能得此炁','凡炁之在彼','凶惡之炁','凶炁凝空','出本身火炁呵入符','出炁入將','出炁放令口中','刃炁','分光化炁','分形散炁','分炁爲形','分眞化炁','分身化炁','初弦之炁','初炁以爲丹本','初炁致柔','判合之炁','則其炁自升','前炁','前炁團如圓鏡','剛烈之炁','剛風浩炁','加炁','助吾炁','助炁送出子午','勇炁堅固','動而流行者爲陽爲炁','勝其炁','勢必煉而炁不聚','勾陳之炁','化凝之炁','化炁','化炁以成人身','化炁則爲梵淸景','化生和炁','化精爲炁','北斗瑶光之炁','北方之炁','北方正炁','北方水炁','北方炁','北炁','北部水炁','十二雷公炁','升之爲炁','午南文炁','午炁','南方火炁','南方火雷之炁','南方炁','南極一炁','南炁','卦炁','卯卦而于炁','卯炁','即爲之有炁也','又炁急','又運此炁布之','取三帥炁','取中大炁','取中炁','取北方炁','取南火炁火光呵炁','取天炁','取斗炁','取本日將炁','取東南炁','取此炁吹于身','取火炁向離','取火炁而呵出','取炁','取炁書符','取然炁','取狂人炁','取生炁','取逐方炁','受炁不存','受炁之初','受炁多而精彊','受炁少而精弱','受炁成形','口中之炁','口吐炁','叩齒呵炁','只是炁書','召炁','召炁禳辟','召陰之炁','吁炁爲風','吁炁隨右手劒','各方旺炁','各方炁','各方生炁','各色炁','合吾炁','合彼之炁','合成一火炁','合我七炁','合炁','合爲一炁','合眞風車炁','同升于炁','吐炁','吐炁作雷','吐炁如云','吐炁成云','吐炁成冰','吐炁攝精','吐炁有犯天地','向南吸炁','向左吸淸炁','向巽方吸炁','向支干方吸炁','向正南吸炁','向風來處吸炁','吒唎吽一炁','吞炁','含靈之炁','吸其炁','吸吹吁呼炁于香上','吸此炁','吸淸炁','吸火炁','吸炁','吸炁一口','吸炁一口吹入符中','吸炁一口咽入','吸炁五口','吸炁入勑','吸炁入口','吸炁入心中','吸炁入掌中','吸炁入筆','吸炁入腹','吸炁入身中','吸炁召將','吸炁吹印','吸炁吹符','吸炁吹符上','吸炁咽津','吸炁迸自天目','吸炁騰空','吸雷文炁','吹散病人身中毒炁','吹本炁于離','吹炁','吹炁一口','吹炁合之','吹炁向雷門','吹炁如前','吹炁成風','吹炁爲雨','吹賢炁魁丘先斗','吾助汝炁汝助吾靈','吾身之炁聚在吾身','周帀一炁','周身之炁','呪一炁','呪炁','呪炁入全形','呪炁入天罡','呪炁罡訣','呪畢吹炁','呪畢呵炁','呪盡通炁','呬吹之炁','呬炁','呬炁爲雷','呬炁爲電','呵出炁于符','呵吹呼炁','呵炁','呵炁一口','呵炁一口于巽','呵炁一口于符','呵炁一口入南方','呵炁九次','呵炁同入符','呵炁在左','呵炁成火','呵炁爲云','呵炁爲雷','呵炁發火','呵炁隨右手劒','呼則炁下吸則炁上','呼炁','呼炁向坤','呼炁爲云','命一炁','命則未始炁','命官之炁','命炁','和平定炁','和柔之炁','和炁','和炁以致祥','和炁來合','和炁應則虛白自然也','咬牙關忍炁忿怒而作','咸耀之炁','咽炁一口','咽炁和中','唵吽吒唎閑炁','善視者止見于炁','喜炁','喪神敗炁','嘘炁','嘘炁成風','嘻炁爲雨','噀炁','噓炁','噓炁可以治病','噓炁隨劒','噴炁發訣','嚙𡄦一炁','四方之炁','四方火炁','四方炁','四方香炁','四時不正之炁','四時疫厲之炁','四正之炁','四炁','四炁和平','四炁朗淸','四體之炁','因形畱炁','因時起炁','因炁上升','因炁之動而復化爲精','因炁有形','因炁而生炁','因理有炁','因神之動而復化爲炁','固其炁','固根炁','固炁成丹','固炁畱精','國喩炁','土之炁','土炁','土炁凝結','在地之炁自然上朝','在炁爲呵噓呬','地以炁上昇','地以炁而發生','地户炁','地水之炁','地炁','地炁上騰','地炁上騰天炁下降','均體同炁','坎中有炁','坎宫炁','坎文炁','坎炁','坎非是炁','塪炁','夏至之炁','外來之炁','多言損炁','大呵出炁','大寒初炁','大將炁大神太玄','大神之炁','大道之炁','天一之炁','天丁助炁力士','天上之淸炁','天中之炁','天之炁','天以炁下降','天以炁而運行','天以炁而降','天動地害炁流行晝','天地一炁','天地之中炁','天地之母炁','天地之炁','天地之秀炁','天地人同炁','天地人物一同有此炁','天地以炁而昇降','天地否極炁俟不調','天地得此一炁','天地旣得此炁','天地無此炁','天地生一炁','天地秀炁','天地純粹之炁','天地能抱此炁','天宫之炁','天性之炁','天晴雷雨炁何求','天朗炁淸','天河有炁似蛇行來','天灾流行之炁','天炁','天炁下降','天炁流輝','天炁開朗','天炁陰霾霧不開','天目中光炁','天蓬炁','天谷之炁','天門光炁','天門方上炁','天門炁','天門炁結','天開炁朗','天雷一炁','太丹之炁','太乙炁','太初炁之始','太和之炁','太極一炁','太極中炁','太極乃一炁旣動','太極之炁','太無之炁','太虚之炁','太虛中旣有炁化','太虛之炁','太陽之炁','太陽九芒眞火炁','太陽光炁','太陽餘炁','夫有此一炁則雷霆晴','失臣則失炁','女炁','如炁之及于腳底','如炁沖塞上運','如炁蒸于泥丸','妖炁','妖雷之炁','妙凝正炁','妙炁','妙道生一炁','妙靈之炁','始炁','始祖之炁','始而其炁柔脆','始而有炁','委炁','委炁聚功德','威武陳炁','威武陳炁髣髴兮','威毒之炁','娑婆薩訶炁','子炁','子炁丑文','孕炁育神','存炁','存炁到星','存炁則神全','存炁吞之','存炁温温','存神伏炁','存精則炁全','存香炁中','宅炁','守炁定神','安神定炁','完其精而炁自舒','定以長炁','定息住炁','定炁','定炁却鬼','宛轉流通者曰炁','害炁','宸輔衝淸炁','寅炁','密念逼炁','寒炁出','寓于炁','寓炁','實不過一炁耳日爲離','寳光之炁','寳華炁','尊其炁貴其形','對太陽吸炁','導迎和炁','少陽少陰之炁','尸炁','居丑比炁','屏炁','山川出炁','山澤炁剛','山澤炁通','山澤通炁','岀炁以本','嶽炁','巳炁','巽四炁','巽宫神霄炁','巽巳上炁','巽户靑紅炁','巽方呵火炁','巽炁','市炁入符','布炁','布炁行符','布熱炁','布生炁','帝宸一炁','平心定炁','平旦之炁','平炁','平炁定心','平炁順筆','年老炁衰','庚辛金炁','度炁關入口','庭索聲怨炁冤家債','廉貞炁','引丹天炁灌入符中','引淸炁','引淸炁咽之','引淸炁衝激','引火炁入腎','引炁','引炁咽入','形下謂之炁','形中有炁','形將爲炁','形消炁化','形炁未安','形炁非神','形爲炁主','彩炁','役一炁','役神馭炁','後天一炁黙運身中','得其炁者成形','得炁而升','得炁而降','御炁','御炁合仙飛','御靈興炁','復統一炁再使萬物生','微芒之炁','心不凝則炁不降','心中之炁','心中火炁','心中炁','心中炁自舌出','心中絳炁','心動而炁不寧','心在炁中','心定炁起','心平炁定','心神和悅炁常存','心肝之炁','心腎之炁','心與炁合','心與炁隨','心與炁離','志一則動炁','思此炁徧于吾身','怡其炁','性也炁也理也','性命者一炁之本','恐炁脱再念','息心定炁','息靜炁匀','惡毒之炁','惡炁','愈煉而炁愈散者','愈煉而炁愈紛','意炁','意炁才萌','意炁相隨','戊己之炁','戊己相會之炁','戌炁','成導迎和炁皓華虚神','我炁益調','或不作炁或不誦呪','戾炁','手中併炁與罡同出','抵上腭出炁','捉炁','捺炁','掐訣吹炁','掐訣通炁','排空馭炁','排空馺炁','掩日炁','提中炁','提炁入祖穴','搬負正炁','搬運正炁','摧炁','攝一炁','攝右𡄼炁','攝炁','攝炁含晶','攝炁生神','攝炁聚神','攝遊炁于八衝','收其炁入斗','收回外炁','收威伏炁','收淸炁送納','收炁','收炁保生','收炁存神','收炁布脚下','收炁歸神','收炁聚云','收炁聚煙','收炁食炁','攻炁','放炁過關','故炁','敕炁','敢當爭炁者','散則成炁','散則爲炁','散炁','斗中炁','斗中絳炁','斗文光炁','斗炁','方炁','旣有炁','日月之炁','日月炁','日炁','日用之炁','日與正炁合','日辰方炁','旺炁','旺炁如云如霧','旺相之炁','明仙之炁','昏濁之炁','星炁','是以之炁','是炁也是性','是炁原天地人物生生之本','是炁固先天地而常存','是神是精是炁','時炁','晦冥之炁','景炁','景炁雷祖','晴和之炁','暖炁心龍神元凝','曰炁也','書炁','書炁字','書炁臣','書符時全在閉炁','最要淸炁','月炁','月華之炁','有不煉而炁散','有炁可潜通','有炁而未有形','有炁而無質','有物則炁在物','服九口炁','服炁','服炁餐元皇','望之吸炁','望南吸火炁','望巽取長炁書之','望巽吸炁','望巽户吸炁','望巽方吸炁','望巽玉炁','望後而吸炁','望炁','望病人吸炁','朝炁于','木德星結炁','木炁','未兆形已前之炁','未吸炁時叩齒','未必遂滅此炁','未炁','未見炁也','未見炁者','本原之一炁','本命炁','本官炁','本宫本炁本字','本宮之炁','本方之炁','本身之炁','本體炁','朱炁','束炁','東南之炁','東南梵存炁中使','東南炁','東方炁','東方生炁','東方虛皇炁','東極青華炁','東炁','枉而爲陰爲柔是此炁','某炁','栖神導炁','根炁','梵寳之炁','梵混之炁','梵炁','梵英之炁','梵陽之炁','横炁自作燒爍','檄炁出神','正䧟中其炁','正一生炁','正中之炁','正元混炁','正月初炁','正炁','正炁一合心','正炁合仙眞','正炁歸胸','正直之炁','正眞之炁','正陽之炁','此柔脆之炁','此炁乃父母未兆形之前','此炁乃萬法之祖','此炁之彌綸而磅礡','此炁之浩浩蕩蕩','此炁之渾渾淪淪','此炁之運行','此炁俱赴魂旛','此炁則不生不滅','此炁即黃庭也','此炁卽從呱鼻出入往來','此炁在于空中','此炁寓于天壤','此炁渾渾淪淪','此炁爲之主','此炁至柔而剛','此炁至玄至祕','此炁與後天兩腎','此炁若是陰陽五行之炁','此炁虛浮而喪炁','此炁降于非身','此炁非口非鼻','此炁非有形','此炁黃庭眞土','此理此炁','此間之炁','殺炁','母炁','每言一炁','比炁也','比炁呪曰','气治厭炁治','水中之炁','水中有炁','水散則成炁','水火之炁','水炁','水炁上騰','水炁濛濛','水炁瀰漫','水鬼爲殃炁塞胸','汗炁如云','沖和之炁','沖和之炁結而成人','沖炁','治某炁','治炁','法如後一炁天經','法炁','注炁','洞元之炁','洞炁','洞笈之炁','洩其炁亦何用也','浩炁','浩然之炁','浩然炁','浩蕩之炁','浮翳之炁','液中之炁','液少難生炁','淨者爲佳炁','混元一炁','混元之精水炁','混合一炁','混合空洞炁','混成一炁','混沌一炁','混沌之炁','混然一炁','混然一炁如未判之初','淸剛之炁','淸微一炁','淸明之天炁','淸炁','淸炁散形','淸炁昇而爲天','淸炁結像','淸炁雷','淸炁雷祖','淸華之炁','淸虛之炁','淸陽之炁','温和之炁','温炁補','游炁滿天凝復散','渾淪一炁','演田之炁','演由之炁','潮熱炁候邪鬼','潰炁','濁炁','濁炁積而爲地','灝炁','火候﹐炁也','火光炁','火旺之炁','火是炁也','火炁','火炁上昇','火烈之炁','火煞方炁','火色炁','炁一則動志','炁不上行','炁不入于胎','炁不動則神自靈','炁不可忍','炁不可爲法之所役','炁不和平','炁不得妄干','炁不殊','炁不足','炁不離神','炁中之水','炁中分陰陽','炁中收取眞一之水','炁中有水','炁中有炁','炁中有眞一','炁中有眞水','炁中有神','炁中有象','炁中生水','炁中生液','炁中生炁','炁中生神','炁中眞一','炁中眞一之水','炁中自有水','炁中自生眞水','炁主于升','炁乃元陽','炁乃化爲美液','炁乃神之主','炁乃自然靜息','炁乃養精','炁之使然','炁之動盪者','炁之始','炁之始也','炁之所以依神','炁之柔弱','炁之根','炁之歸神','炁之母','炁之洋洋','炁之浩然','炁之混沌','炁之淸濁','炁之祖','炁之聚散','炁乘月相','炁亥卯未入','炁亦因之大定','炁以生神','炁以禦符','炁住則生神','炁住水住','炁住爲神','炁住神靈住','炁何壯乎','炁何由受','炁使之然','炁來','炁依于神','炁依神','炁依神行','炁候','炁候瘟疫邪精毒炁','炁候神','炁候起止','炁傳六候','炁傳子母','炁入丹田','炁入玉璫','炁入符','炁入腦中','炁全眞性','炁冥冥','炁凋神逝','炁凝下注','炁凝則精固','炁出之次','炁到之時','炁到心','炁到肝','炁則化血','炁則可以合','炁則稍遠','炁則隨之動靜','炁動','炁動則判','炁勢充盈','炁勢衝衝','炁包心外','炁化之流行于太虛','炁化成神','炁化未有之先','炁化流行于太虛','炁化爲形','炁化爲精','炁化神','炁升','炁升液降','炁卽古人謂水中之金','炁卽命','炁卽從之','炁又化液','炁右符','炁合乎炁','炁合日月星','炁合生炁','炁合體眞','炁吹于符','炁吹入符','炁吹布于符','炁周神外而不覺','炁命','炁和則息始調','炁和則息調','炁喘云生','炁在中丹','炁在人身','炁在先而神在後','炁在是','炁在炁穴','炁壯','炁壯神全','炁字章','炁字符','炁孛','炁孛輝耀古今','炁宇軒昂','炁定息瞑','炁定神凝','炁寒而凝','炁專神凝','炁屬先天','炁屬陰陽','炁已散','炁府','炁廼理也','炁弱','炁弱則病','炁形質具','炁後有七星','炁從兩眼岀','炁從兩耳出','炁從口出','炁從有胎中息','炁從陽生','炁復歸精','炁微','炁必外泄','炁必歸根','炁感妙化','炁戀夫神','炁成云霧','炁戰剛彊','炁所由以生','炁拘物蔽','炁攝','炁散','炁散水散','炁散神昏','炁散難生液','炁數','炁旣動','炁旺','炁明子午抽添','炁映玉淸','炁是外藥','炁暢神融','炁有玄元始之稱','炁本于命','炁本虛也','炁根','炁極則','炁極生液','炁機','炁正上元','炁歸于臍','炁歸玄竅','炁歸玉皇','炁歸神結丹','炁歸臍中胎息','炁歸臍則爲息','炁毒','炁比陽','炁水不交','炁水之間而有眞陰眞陽','炁水相合','炁法','炁注規中','炁海','炁海中新生之炁','炁液','炁液升降','炁液太極相生','炁液相生','炁淵如也','炁渾于無象','炁滿','炁滿丹田','炁滿取元炁','炁滿成形','炁炁相守','炁炁還故根','炁無不一','炁無不同','炁無不怡','炁無其炁','炁無所聚','炁無理不行','炁無知','炁焰衝天','炁煉形質','炁爲元','炁爲眞','炁爲神之所生','炁爲神母','炁爲神胎','炁爽神淸','炁環于外','炁生','炁生于腎','炁生時液亦降','炁生精','炁由神','炁由精化而產','炁疾','炁發則成竅','炁盛','炁盛而魂中無陰','炁盡','炁神','炁神之爲裏','炁神本年','炁稍調','炁稟有限','炁積而生液','炁穴','炁穴中之炁','炁符','炁絕','炁綿綿而徘徊','炁罡','炁者生一之祖','炁耶神耶','炁聚','炁聚爲寶','炁聚神全','炁聚神會','炁聚而爲一','炁育萬生','炁能生神','炁脈靜而內蘊元神','炁自生','炁自腎中','炁臭是家親傷亡','炁至盈也','炁至繁也','炁與水','炁與液','炁與神','炁與筆俱運','炁與精','炁芒','炁號竅','炁行于五臟','炁行如泉','炁行子母','炁行旣久','炁行液注','炁術','炁衝云陣','炁衝太虚','炁衝日月','炁要見眞','炁訣','炁識神','炁變','炁象','炁象所爭','炁貫玉淸','炁足丹成','炁足生寶','炁足神完','炁足而心自定','炁車','炁返元命','炁返玉海','炁運','炁過肝時','炁還于命','炁醫','炁鑿如火焚','炁長生','炁長神旺','炁阻神銷','炁隆驚天','炁隨神行','炁隨胎化','炁離則合','炁雷','炁非呼吸之气','炁順如泉','炁顧不重哉','炁養靈源','炁騰牝府','炁默默','炁𨿽煉而成神','炁𨿽虛而有形','炁精','炎炁流煙','焚符吸炁','無一紅白炁','無一點水炁','無形之炁','無極純乎炁','無極而乃未見炁','無炁','無物則炁還太空','無知之炁','然後閉炁','煉形成炁','煉形炁神','煉形聚炁','煉心得炁','煉心累炁','煉心進炁','聚精累炁','積精生炁','積精累炁','煉此炁入丹田','煉炁','煉炁之本','煉炁合神','煉炁成神','煉炁者陰陽之至精','煉眞集炁','煉精成炁','煉精還炁','煖炁','煞方炁','煞炁','煥焚炁','熊炁','熒煌之炁','熱者屬炁','物可以寓炁','物禀一炁','物蔽炁拘','獨運天炁','玄以升炁','玄元一炁','玄元始炁','玄光之炁','玄冥之炁','玄天炁','玄妙本乎一炁','玄帝炁','玄明炁','玄溟之炁','玄炁','玄照之炁','玄眞之炁','玄色之炁','玄通之炁','玄黃之炁','玉女隨炁來臨','玉淸之化炁','玉皇之炁','玉皇正炁','玉皇炁','玉虚之炁','理炁','理炁合一曰仁','理炁性命同出一源','瑞炁','瑶光正炁','瑶華之炁','甚哀之炁','生于炁','生旺之炁','生炁','生炁下降','生炁五方五雷','生炁靑龍符','生生之炁','生神一炁','生育之炁','生身受炁','用之于炁','用之仍以炁字爲座子','用口吹炁出在面前','用此炁捺下坎宫','用炁訣','用鼻𡄼炁','由此炁一煉','由炁之自下而上','由炁之自微而顯','由炁依神而生','甲炁','申炁','男炁','異炁','當日交炁','當炁未充時','疰炁','病炁','瘟毒炁','瘟炁','瘟疫毒厲之炁','瘟邪魍魎炁候','瘴炁','癘炁','發炁召龍','發訣吹炁','發訣通炁','白光之炁','白杳之炁','白炁','白瘟之炁','白級素炁','白芒之炁','白虎朱雀炁','白虎炁','白霞之炁','皇老一炁','皇老七炁','皓炁無涯','皓華之炁','盛炁','盜其炁于混沌之鄉','盤薄成炁','目炁','直而爲陽爲剛亦此炁','直養則炁足','相尅之炁','相炁','眇炁合云','看炁降','眞一之炁','眞元正炁','眞光正炁','眞水之炁','眞水戀炁','眞火之炁','眞炁','眞皇淸炁','眞陰隨炁上行','眞陽之炁','眞精之炁','知我之炁','短濁之炁','碧光之炁','碧湧之炁','碧炁','碧玉炁','碧霄之炁','祈晴用生炁','祈雨尅炁','祖炁','神不靜而炁亦弱','神中生炁','神之入炁','神于炁','神交炁感','神以禦炁','神依于炁','神依炁立','神入室炁自回','神入炁','神入炁成胎','神入炁胎','神全炁壯','神全炁定','神凝炁住','神凝炁聚','神動炁隨','神合其炁','神和炁合','神在先而炁在後','神威炁衝','神安則元精吐華而炁生','神定炁升','神定炁和','神布一炁','神弱炁衰','神强炁壯','神戀炁','神抱炁','神水生于炁中','神淸則炁凝','神淸炁爽','神炁','神父炁母','神由炁','神者形炁之主','神與炁','神與炁精','神蛇吐炁','神融炁定','神融炁暢','神衰炁竭','神識炁','神返身中炁自回','神運淸炁','神閒炁定','神隨炁','神隨炁生','神隨炁至','神霄炁','神霄空洞炁','神靜則炁','神非形炁','祥瑞之炁','禀炁','禀炁太無','禀炁搆形','禁炁','秀媚之炁','移精變炁','積精養炁','積陰之炁','穢尸血腋炁','穢炁','空敕炁','空洞炁','端由一炁分','符炁','符炁速通靈','符章炁訣','筆隨炁而行','策炁','策炁凝空','節炁','紅光之炁','紅惠之炁','紅炁','紅玉之炁','紅白之炁','紅絳之炁','紅陽之炁','紅黃炁','納炁會于規中','純剛之炁','純陰之炁','純陽之炁','純陽至剛之炁','素炁','紫户之炁','紫炁','紫虛之炁','紫赤之炁','結炁','結炁以成形','結炁成像','結炁成符','絪縕之炁','絳宫之炁','絳宮之炁','絳炁','綘光之炁','緊閉喉間炁','緑光之炁','緑炁','緘口炁','緘炁調息','緫炁','總炁','罡我之炁','罡方上正炁','罡炁','罡風浩炁','罡風驅浩炁','罪炁','群類資生者亦此炁','老君一炁','考炁','而升道以炁而生法以','而此炁同','耗其炁','耳聞其炁','耴炁','聖炁','聚一口炁','聚則成炁','聚形散炁','聚彼之炁','聚炁','聚炁于丹田','聚炁凝神','聚炁在中丹田','聚炁成符','聚炁爲眞','聚靈會炁','聲炁相通','聽之以炁','肅殺之炁','肅煞之炁','肝中一炁','肺中一炁','肺中素炁','胎仙不炁足','胎受五行之全炁','胎完炁足','胎炁','能屏息調炁合身尅應','脂粉炁','腎中一炁','腎中炁','腎宫之炁','腎府之炁','腎是炁之海','腎爲炁之根','膀胱之炁','膀胱炁','膽中緑炁','膽炁','臍爲生炁之門','臍田之炁','臍輪之炁','臓炁','臟之炁','臣卽炁','自一炁胚腪之後','自有炁','自然一炁','自然之炁','自身炁宇','至柔之炁','至淸之炁','至陰之炁','至陽之炁','至靜中生炁','與天地同分此炁','與炁交融','與炁俱通','與炁相守','與炁通津','舍之炁','舍炁','艮炁','芒之炁','芒炁','芝云之炁','英雄之炁','莫干我炁','華耶一炁','萬年不蔽者此炁','萬炁','萬炁長存','萬物榮炁','萬物歸一炁','萬神並如炁至','萬神隨炁而至','蒸鬱此炁而生滂沛','藉炁以爲用','虚炁','虚空光炁','虛無之炁','虛空之炁','虛靈之炁','虹炁','蝗炁','血中之炁','血蠱血光之炁','行一炁于先天','行此一炁可以感天地動鬼神','行炁','行炁咽液','行神市炁','補炁生神','西北之炁','西方炁','西極太清之炁','西炁','見炁自聚','調息聚炁','調炁定息','請一炁','請中央一炁戊己之精','請某炁','請炁','請西方七炁庚辛之精','論理不論炁','諸將隨此炁並化','諸炁無土不能聚會','諸炁無土不能造化','護身生炁','象緯之炁','賦之炁以立命','質炁之性','赤光之炁','赤子之炁','赤帝養炁','赤水之炁','赤瀑之炁','赤炁','赤瘟之炁','赤色之炁','赤霞之炁','赤飈分炁','赤黑之炁','赤精之炁','走洩口炁當','超乎一炁之先','趙德炁','身中之炁','身化炁來','身𨿽沒而炁不沒','輕淸之炁','輪一炁','轉炁旋魁','轉輪之炁','辰戌丑未四方炁','辰方炁','辰炁','辰爲炁目','逐炁','逐炁而淸','逐炁通靈','通炁','速聚生炁','連炁入符','連炁吸入壇','逼炁','運一炁于先天','運一炁以成符','運炁','運炁寫入符','運炁斡旋','運炁流形','運炁自尾閭','運者謂之炁','運自己正炁','運轉精炁','運鼻炁從耳舌化爲祥風','道法以炁而感通','道炁','道祖一炁','道貫三才爲一炁','道𨿽有炁動','邪炁','都正一平炁','鄹我之炁','酆都炁','酉炁','采炁者','采陽﹐炁也','重濁之炁','重濁之炁凝結','金丹之炁','金之炁','金光一炁','金光之炁','金光寳炁','金光正炁','金光火炁','金光炁','金母之炁','金水之炁','金炁','金玉之炁','金白之炁','金眞掃炁','金色火炁','金靑之炁','鉛中之炁','鉛之炁','鉛炁','鉛炁之炁','錯謬之炁','鎭貼不用炁','長保其炁','閉吾一炁','閉息則炁聚','閉此一口炁','閉此炁','閉炁','閉炁令緊','閉炁定息','閉炁書符','閉目定炁','閉目息炁','閉目閉炁發三昩火','開口呵炁爲天火','關節炁通','降一炁水火眞符','降炁','陰中藏炁','陰寒之炁','陰寒炁結','陰海之炁','陰濁之炁','陰炁','陰藏炁中','陰蹻之炁','陰陽不正之炁','陰陽之炁','陰陽以炁而慘舒','陰陽眞正之炁','陰陽者炁也','陽和之炁','陽壯而魄中有炁','陽炁','陽羅炁','陽雷之炁','隨其炁而引之','隨内炁','隨吾一炁','隨炁','隨炁一筆','隨炁上昇泥丸','隨炁入丹田','隨炁升降','隨炁吐納','隨炁吹手','隨炁吹腰','隨炁吹足','隨炁安寧','隨炁應眞','隨炁斡旋','隨炁書成','隨炁書符','隨炁生尅','隨炁而至','隨炁速現','隨炁運動','隨炁過三關','雜惡之炁','離炁','難道無有此炁','雷公之炁','雷火一炁','雷火炁','雷炁','雷神之炁','雷路有炁','雷轟龔狠炁','雷雨之炁','雷雨淸炁','雷霆一炁','雷霆淸炁','霄之炁','震炁','霧炁','靈官運炁','靈根之炁','靈炁','靈異變化無過一炁','靈育明炁','靈陽之炁','靉靆海炁','靑光之炁','靑帝九炁','靑温之炁','靑濠之炁','靑炁','靑瘟之炁','靑白之炁','靑碧之炁','靑碧炁','靑紅炁','靑紫緑炁','靑華之炁','靑霄之炁','靑霞之炁','靜其念則炁融','靜定通炁','非我之炁','非炁全者','非神非炁非精','非精非炁非神','面北吸炁','面東南吸炁','頂中出炁','頂迎之炁','順炁玉女','順神養炁','須吸炁便收兵','須閉炁一筆掃成','願降妙炁流布九淸','顧一炁之威','風炁','風炁旣甚則云炁難成','風雷以炁而動盪','飛云散炁','飛斗取炁','飛火鈴鼓炁','飛神馭炁','飛符演炁之章','食母之炁','食炁','食炁結炁','飮食煙炁','飯炁','養其炁','養吾浩炁','養炁','養炁通血','養眞固炁行法','香炁衝起','驚蟄正炁','高上之炁','鬼炁','鬼門炁','鬼𤵙尸癆之炁','魂炁','魄炁','鳳炁','鳳炁經','黃中理炁','黃云之炁','黃光之炁','黃帝一炁','黃庭之炁','黃演之炁','黃炁','黃白炁','黃絹炁','黃錦之炁','黃錦炁','黃霞之炁','黃黑之炁','黑光之炁','黑殺之炁','黑炁','黑炁三衮','黑瘟之炁','黑色炁','黑霞之炁','黑霧炁','鼎中有炁','鼻中一炁','鼻吸淸炁','鼻吸炁縮兩腎','鼻引淸炁','龍虎精炁','龍見炁相合','𠾬吽一炁','𠿞一炁','𩕄門炁','𩲸炁','𩳐魒之炁','𩳐魒九炁','精中之炁','精依炁盈','精凝炁調','精化炁','精化爲炁','精涸炁嘶','精炁','精炁元神','精炁爲物','精炁生','精炁神','精炁神在上','精炁神玄竅','精炁耗散','精盈炁足','精與炁','精融炁化','精𨿽煉而爲炁','精﹑炁﹑神都在先天','專炁致柔',

	'精炁神三寶','卽「炁」',
	//'涕唾精津炁血液','炁血','炁血衝突','其或炁血而交通之','收閉炁息','忌炁息傳染','聞是何炁息','炁息','炁息往來','炁息調匀','忿炁','怒炁衝天','號怒炁','人以怒炁合之聲','無怒炁心火不發','血炁','神禀血炁而生','積炁','積炁在上','積炁液','積炁生液','積炁生神',
	//'脾炁','脾炁入腎土','呼脾炁','腎炁','腎炁上合于心','腎炁入心水','腎炁吹入符','肺炁','肺炁入肝金','呬肺炁','肝炁','肝炁入肝木','離火合心炁','心炁','心炁下腎','心炁下降腎水','心炁不足','心炁入肺火','心炁合之','心炁虚書','呵心炁','呵心炁出香','呵心炁存苟元','凝心炁','取心炁相合','落取心炁入海停流',

	//'寶精裕炁','裕吾之炁','裕炁須隨自在',
];

let daoistTokenT = [
	'气炁氣',
	['形淸則合于炁',/形淸則合于气/g],
	['炁淸則合于神',/气淸則合于神/g],
//	['交姤',/交媾/g],
];
for(let o of daoistToken) {
	let oPattern = [];
	oPattern.push(o);
	oPattern.push(o.replace(/炁/g,'气'));
	daoistTokenT.push(oPattern);
}
daoistTokenT.push(['煉炁',/[煉鍊][炁氣气]/g]);
daoistTokenT.push(['後天之气',/後天之炁/g]);
daoistTokenT.push(['後天气',/後天炁/g]);
daoistTokenT.push(['凡气化爲',/凡炁化爲/g]);
daoistTokenT = daoistTokenT.concat(daoistDefT);


//console.log(daoistTokenT);



let daoistT = [
	'气炁',

	['$1炁',/([始累服靈伏化煉鍊金合裕理藥梵眞元寓內外馭道浩一二三精精神玄景陰陽]|先天一|神生|至靜中生|道貫三才爲一|太和一|神由|以我之|返彼之|精化|未見|淸陽之|陰濁之|中和之|天地之中|眞之|淸和之|虛之|乾元一|陽之|陰之|虛無之|一之|神凝|天之|我之|不知有|地之|淸淨之|神隨|積精累|不是外來之|先天|神與|神調|先天淳朴之|淸空之|神遊而|神未入|散則成|所謂|靜則爲|鮮不于|神包|神入|神歸|伏其|神不入|神未與|一元之|必于此|精化爲|聽之以|無精則無|流行之|流通活潑者)气/g],
	['炁$1',/气([產動壯滿穴合行機眞實]|生神|之在彼|時歸于爐內|爲心使|由神|沖和|散神昏|分眞|自眞|之妙|化神|之始|之混沌|默默|之祖|有餘妍|包神|動神|常定|與神|稍調|暢神融|不是外來之|凝神|貫太和|歸元|爲性用|動而神|未歸神|自化|存則人存|亡則人亡|之所關非細|之衰旺|入神|因神|不伏神|未與神|中靈而覺者|化爲神|得神|生之兆|化流行|有所歸|不妄動)/g],
	['靜其念則炁融',/靜其念則气融/g],['炁合乎炁',/[炁气]合乎[炁气]/g],
	['以炁$1',/以气(相召|而靈)/g],
	['$1以炁',/([天地]|陰陽|風雷|人身|道法)以气/g],
	['一炁爲陰陽之','一气爲陰陽之'],['一炁之$1',/一气之(瓊章|周流)/g],
	['受炁之初','受气之初'],['性爲炁體','性爲气體'],
	['炁了炁',/[气炁]了[气炁]/g],

	['$1气神',/(後天之*精)炁神/g],
	['神气$1',/神炁(什麼|活現|飛揚)/g],
	['$1气',/(先後二|後天之|先後二天之)炁/g],
	['气$1',/炁([質]|尙粗)/g],

	/*
	['盛气淩人','盛炁淩人'],
	['气$1',/炁([機勢粗浮化性阻血韻憤質習數怦運味魄派槪氛候溫象息餒節和]|有餘)/g],
	['$1气',/([噓理和凡躁燥才財血力殺煞淸風天地受呼吸服咽鬥士溼蒸熱冷暖尸陰陽口穢生死絕和驕風抑習云瑞香出志形紫人濁節]|呼吸之)炁/g],
	['趾高气揚','趾高炁揚'],['心安气和','心安炁和'],
	//*/

	['受炁成形',/受气成形/g],
];

//console.log(daoistToken[0].replace('炁','气'));

const contextT = [
//	['气',/^\s*炁\s*$/g],





	['達摩',/達磨/g],
	['三丰',/三豐/g],['抱朴子',/抱樸子/g],
	['出家',/齣家/g],['亙古',/亘古/g],['唯唯',/惟惟/g],['表奏',/錶奏/g],
	['昏憒',/昏[瞶聵]/g],
	['了解',/瞭解/g],
	['$1錶',/([鐘手腕])表/g],
	//古文：浮陽侯孫程等懷表上殿爭功
	//['$1錶',/([懷])表/g],
	['男女交媾',/男女交姤/g],



	/**
	 * 商於
	 */
	'於于',
	//'于於',
	//['商於',/商于/g],['於戲',/于戲/g],['樊於期',/樊于期/g],


	/**
	 * 「飡」：寒食，冷「餐」
	 */
	['飡霞',/餐霞/g],


	/**
	 * 叶通協
	 */
	 '葉叶',
	 ['叶$1',/葉([韻律])/g],
	 ['$1叶',/([音])葉/g],


	/**
	 * 「脩」：肉
	 */
	'修脩',
	['束脩',/束修/g],
	['未有知其脩者',/未有知其修者/g],  //語出《莊子#逍遙遊》



	'咸鹹',
	//['咸平',/鹹平/g],['咸平$1',/鹹平(.{0,3}[年初中])/g],['咸平親郊',/鹹平親郊/g],
	['服此鹹平',/服此咸平/g],['以鹹平之',/以咸平之/g],
	['鹹傷血',/咸傷血/g],
	['$1鹹',/([味很微])咸/g],
	['鹹$1',/咸([味])/g],
	['鹹$1',/咸([.?寒甘辛苦酸])/g],
	['$1鹹',/([.?寒甘辛苦酸])咸/g],
	['鹹枳實',/咸枳實/g],
	['鹹$1',/咸(.{0,3}[心肝腎脾肺陰降泄熬淡])/g],
	['$1鹹',/((澤瀉|決明子|羊血|瓦楞子|紫檀|白薇).{0,3})咸/g],
	['$1鹹$2',/([气味].{0,3})咸([^臻])/g],
	['$1鹹',/([食喫])咸/g],
	['鹹$1',/咸(.{0,3}無毒)/g],
	['澤山咸',/澤山鹹/g],
	['咸豐',/[鹹咸][豐丰]/g],


	'郁鬱',
	['$1鬱',/([翳濃沉沈蔥抑憂懮陰黯暗])郁/g],
	['鬱$1',/郁([冒悶結色麗鑑氣气])/g],
	['鬱鬱',/[鬱郁][鬱郁]/g],


	/**
	 * 不確定時寧可用「象」不要用「像」
	 */
	//'象像',
	['$1象',/([想卦爻])像/g],
	['$1像',/([成外銅雕擬攝設錄神影畫圖照造塑築捏人鏡對映印虛實])象/g],
	//['$1像',/([反倒])象/g],['$1象',/(反倒)像/g],
	//['$1像',/([形])象/g],['$1象',/([外]形)像/g],


	'衝沖',
	['$1沖',/([林曹桓幼])衝/g],
	['令狐沖',/令狐衝/g],
	['沖兒',/衝兒/g],
	['沖$1',/衝([融齡虛漠舉和醒淡洗刷水氣气炁])/g],
	['沖$1',/衝(斗府|斗牛)/g],
	['$1沖',/([穢光水氣气炁霞])衝/g],
	['沖$1',/衝([泡克剋尅妙])/g],
	['$1沖',/([六刑])衝/g],
	['$1沖沖',/([興气炁氣].{0,1}?)[衝沖][衝沖]/g],
	['道沖而用之',/道衝而用之/g],
	['沖者中也',/衝者中也/g],
	['大盈若沖',/大盈若衝/g],
	/**
	 * 「肩沖」圍棋術語，用以侵消外勢，「沖」者「中」也，故用「沖」。
	 */
	['肩沖',/肩衝/g],
	/**
	 * 「生克沖合，刑沖克害」卜易用語
	 */
	['沖$1',/衝([合克空])/g],
	['衝衝',/[衝沖][衝沖]/g],
	['衝$1',/[沖]([突勁])/g],
	['衝$1',/沖(.?撞)/g],


	/**
	 * 「舍」住
	 * 「捨」放棄
	 */
	'捨舍',
	['$1舍',/([之來入精歸宅守奪草艸結房屋宿茅寒住陋巖退吉])捨/g],
	['舍$1',/捨([下妹炁气陰陽])/g],
	['舍$1',/捨([人][^間貨財])/g],
	['舍$1',/捨(利)/g],
	['黃婆舍',/黃婆捨/g],
//	['$1捨',/([能拋不施四])舍/g],
//	['捨$1',/舍([得棄去事])/g],


	/**
	 * 「幾」數量
	 * 「几」桌類物
	 */
	'幾几',
	['几案',/幾案/g],
	['$1几',/([玉茶案伏])幾/g],
	['几$1',/幾([凳])/g],
	['几$1',/幾(上[放置])/g],
	['幾$1',/几([次時只隻日天年月旬回希])/g],
	['文案幾何',/文案几何/g],['知結宗門案幾重',/知結宗門案几重/g],


	/**
	 * 「後」方位、副詞
	 * 「后」指皇后等，「司」字左右鏡像形
	 */
	'後后',	//別游于向從牛山谷那后顧管唐聞左水井錢家宮秋夏孫周鄭馮褚蔣沈韓秦尢許施孔嚴華金魏陶姜戚謝鄒喻柏章雲蘇潘葛奚范彭郎魯韋昌苗鳳花方俞任袁柳酆鮑史費廉岑薛雷賀倪湯殷羅畢郝鄔安常樂時皮齊康伍余元卜孟平黃和穆尹姚邵湛汪祁禹狄米貝明臧計成戴談宋茅龎熊紀舒屈項祝杜阮藍閔席季麻強賈路婁危江童顏梅盛林刁鍾徐邱駱高蔡田樊胡凌虞萬支柯昝盧莫經房裘繆干解應宗丁宣賁鄧郁單杭洪包諸石吉鈕龔程嵇邢滑裴陸榮翁荀羊於惠曲封芮羿儲靳汲邴糜松段富巫烏焦巴弓牧隗車侯虙蓬全郗班仰仲伊甯仇欒暴甘鈄厲戎祖符景詹束龍葉幸司韶郜黎薊印宿白懷蒲邰鄂索咸籍賴卓藺屠蒙池喬郁胥能蒼雙莘黨翟譚貢勞逄申扶堵冉宰酈雍郤璩桑桂濮壽通邊扈燕冀郟浦尚農溫莊晏柴瞿閻充慕連茹習宦艾魚容古易慎戈廖庾終曁衡步都耿滿弘匡國文寇廣祿闕東歐殳沃利蔚越夔隆師鞏厙聶晁勾敖融冷訾辛闞簡饒空曾毋沙乜養鞠須豐巢關蒯相查荊紅竺權逯葢蓋益桓公俟
	/** 需要列出歷代皇后姓氏 */
	['$1后',/([秀母王太呂薄姬衛武馬曹蕭卞竇陳張伏何趙甄毛郭滕朱吳霍傅梁劉李崔楊夏董])後/g],
	['$1后$2',/([皇])後([^裔])/g],  ///羲皇後裔，始皇後裔
	['$1后',/([陰])後/g],['$1陰後',/([太少厥竅會而直積淮山樹])陰后/g],['陰後$1',/陰后(神田|溪|隨|茂實)/g],  //次發紅花陰後隨
	['$1後陰',/([^秀皇母王太呂薄姬衛武馬曹蕭卞竇陳張伏何趙甄毛郭滕朱吳霍傅梁劉李崔楊夏董])后陰/g],
	['$1后',/([天])後/g],
	['后$1',/後([姬稷土羿妃])/g],
	['風后氏',/風後氏/g],['姓風名后',/姓風名後/g],
	['後$1',/后([天來面學綴進軍排座輩裔嗣福期繼人事續效悔])/g],
	['$1後',/([別以而之此無有隨然前先往肘身座位陣])后/g],
	['$1後',/([一二三四五六七八九十百千萬億數幾多兩廿卅][年月日時旬天])后/g],
	['以后$1',/以後([父配祔弟服貴久歸族])/g],
	['馬後$1',/馬后([炮砲])/g],
	['以後$1',/以后(貴不可言|歸[我正來何])/g],
	['$1以後',/(從今|結痂|四月|中年|分析|看花)以后/g],
	['先$1後',/先([^王皇太]{0,2})后/g],
	/**
	 * 後悔：（過）後悔
	 * 后悔：（王）后（後）悔
	 * 天后：武則天
	 * 天後：（幾）天後
	 */
	['後悔',/后悔/g],
	['陳後主',/陳后主/g],
	['$1夏後',/([春半立仲孟季])夏后/g],
	['先天元后',/先天元後/g],


	['姤$1',/遘(之*卦)/g],['天風姤',/天風遘/g],

	/**
	 * 「穀」食物
	 * 「谷」地形
	 */
	//'穀谷',
	['穀$1',/谷(.?虛)/g], ['谷$1',/穀(.?虛[境也])/g],  //今夫谷虛境也//深山窮谷虛而無物
	['谷$1',/穀([淸東南西北中汲灘川澗水風中神深穴關口底坑雨地])/g],
	['谷$1',/穀(之會|傳聲)/g],
	['$1谷',/([丹暘嶺低暘玄洞丹巖陵龕灘崖百南靑玄大川澗窮深幽進出空花盤龍蛇神鬼若情子午斜天諸天陰陽山溪谿河江海峽裂深合虛])穀/g],
	['$1谷',/([寒蘭])穀/g],
	//滿坑滿穀
	['$1谷',/([滿])穀/g],
	//江河不惡小谷之滿，谷城，谷山
	['小谷之滿',/小穀之滿/g],
	//['谷$1',/穀([城山])/g],
	['$1谷',/(大會爲|進入|退出|狂人|蝴蝶|惡人|山之|山穴曰|天下)穀/g],
	['谷$1',/穀(得一|之盈|之?應聲)/g],
	['學不至谷之訓',/學不至穀之訓/g],
	['$1谷',/(高岸爲|虛懷若)穀/g],
	['$1谷',/(虛無[之]?)穀/g],
	['$1谷',/(太虛[之]?)穀/g],
	['函谷關',/函穀關/g],
	['吐谷渾',/吐穀渾/g],
	//['陽回寒谷',/陽回寒穀/g],
	//打草穀
	['$1穀',/([艸草五辟闢食消稻曬金])谷/g],
	['穀$1',/谷([子倉道气物賤芽])/g],
	['穀$1',/谷(.?[黍稻米麥豆])/g],
	['上谷郡',/上穀郡/g],
	['穀$1',/谷(.{1,2}消)/g],
	['$1谷',/([不])[轂穀]/g],
	//['谷無以盈',/穀無以盈/g],['谷得一以盈',/穀得一以盈/g],
	['谷$1',/穀([無得][一]?以盈)/g],
	['水之谷',/水之穀/g],
	//《山海經》：迷穀，祝餘



	/**
	 * 「只」是語气詞，「隻」是量詞。
	 */
	'只衹隻',
	['$1隻',/([船])只/g],  //我這船只載貨。奪得船隻後，再橫渡大江。
	['$1隻',/([這那一二三四五六七八九十百千萬億數幾多兩廿卅])只/g],
	['隻$1',/只([輪字影身]|鸞孤鳳|履西歸)/g],
	['只言',/隻言/g],['隻言片語',/只言片語/g],['片語隻言',/片語只言/g],
	['只語',/隻語/g],['片言隻語',/片言只語/g],['隻語片言',/只語片言/g],
	['隻眼$1',/只眼([^前下巴看見望觀睜饞])/g],
	['只不過',/隻不過/g],['那只好',/那隻好/g],
	['只$1',/隻([怕見恐因會是能好有要])/g],  //仍然會有錯，但這樣較少。簡轉繁需要能理解上下文的人工智能

	/**
	 * 「姦」有自私之意，「奸」與奸淫相關。
	 */
	'姦奸',
	['奸$1',/姦([夫淫婬殺污汙])/g],
	['$1奸',/([誘通先彊強])姦/g],




	/**
	 * 「採」動詞。
	 * 「采」動詞、名詞。或可接受全部用「采」。
	 */
	 //['$1采',/([文風光])採/g],





	/**
	 * 「余」自我稱謂，或用于地名
	 * 「餘」形容詞：多于基準，或殘畱部份
	 */
	'余餘',
	['餘$1',/余([部散息觽鹽壤甲鑛白士蕃俸落策兵卒憊燼如碧流丁葩萼席多資剩个勢畝量翠效烈位章水木气氣論外夢懷酣葉絲春夏秋冬句妝杯醉困民涼才財譽慶債興思液煙舞糧殘甘姿贈霏暈靄潮芬詩詞歌唱彩照痕悲閏英劍石符指淸同粉潸燻綺霜醺蕊熅薰戶潤妍衾歡齡馥紅綠霞芳響暖酲花韻觴爻子各兵軍賊火物業船寇峰峯輝暉熱寒溫款額震金錢幾食蘊人眾盜孽匪光威地悸力下味情香暇輝波勇災數月日寒瀝福蔭禍殃災聲音話言黨毒怨者])/g],
	//['餘$1',/余([存有])/g],
	//['示余者',/示餘者/g]
	///['餘$1',/余([羨][^慕])/g],
	['餘$1',/余([罪恩愁發])/g],
	['餘$1',/余([可][例推知分思依引勿仿效及悉])/g],
	['餘$1',/余([可]不必)/g],
	//['餘傚此例',/余傚此例/g],
	['餘$1',/余([寸][^心])/g],
	['餘$1',/余([閒][^來])/g],
	['餘$1',/余([論][﹐。，])/g],
	['餘$1',/余([零一二三四五六七八九]+[^歲生])/g],
	['$1餘',/([閏酒賸預倍周香還畝諸節但猶尙尚欠散疑剝病食壽秦華飯暑臘寒步瓜花醉夢閒詩歌霜衾睡午舞雨𤓂薰灰歡空豐更所里春夏秋冬公工業十百千萬緒贏唾結尚盈多少有大小等富無石殘年月旬歲之寸尺丈升斗斛其剩乃])余/g],
	//['$1餘',/([僅])余/g],  //有歧義「僅餘一人」和「僅余一人」，前者「只剩下一人」後者「只有我一人」
	///歧義：[獨惟只僅]余
	['$1餘',/([只僅惟])余/g],
	//['餘$1',/余([生])/g],['余$1',/餘(生[平於于])/g],
	['餘$1',/余([生][^性平於于])/g],
	['餘$1',/余([恨][^不])/g],
	//['餘$1',/余([年])/g],['$1余$2',/([^一二三四五六七八九十百])餘(年[一二三四五六七八九十百]+)/g],
	['餘$1',/余([年][^一二三四五六七八九十百千萬])/g],
	['餘$1',/余([一二三四五六七八九十百千萬])/g],
	['$1餘',/([一二三四五六七八九十百千萬])余/g],
	//「餘經」「余經」各有含義，需理解上下文環境，「餘意」「余意」
//	['余$1',/餘([恐見拜自素就所曾本乃歷試說曰謂杭姚曁干于以有之氏聞意願知論問欲親推可哀猶知曾嘗私疑受懵每惟固因已言])/g],
//	['$1余',/([與惜由語問答荅試邀請])餘/g],
//	['余$1',/餘(英男|不知|念其|子萬民|未得|未知|盡以|皆以|友人)/g],
	['餘$1',/余(無可)/g],
	['餘說焉',/余說焉/g],
	['有餘$1',/有余([意言])/g],
	['收餘$1',/收余([^杭姚江干溪骸骨屍尸])/g],  //韓
	['$1收餘以事親',/(先實公倉.?)收余以事親/g],  //玉粟收餘
	['餘$1',/余([皆])/g],
	['餘$1',/余([絡])/g],
	['餘經$1',/余經([瘧同猶能及起臺𨿽皆可也有中例論尙])/g],
	['餘經$1',/余經(.?[仿脈])/g],
	['餘經$1',/余經(不同|不言|不用|根據|未傷|生用|不動)/g],
	['$1餘經',/([公走交諸並或因謗絡])余經/g],
	['$1餘經',/(干擾)余經/g],
	['$1餘經$2',/([惟以])余經([^歷驗])/g],
	['$1餘$2',/([畱留有])余([意])/g],
	['什物餘經',/什物余經/g],
	['獨餘經在',/獨余經在/g],
	['餘經日辰',/余經日辰/g],
	['餘$1',/余(落日|苦淚|勝[气氣]|燭影|膏馥|稻熟|風韻)/g],
	['餘$1仿此',/余([皆卦]?)仿此/g],['餘$1',/余([可]?類推)/g],
	//['皆餘事',/皆余事/g],
	['餘事$1',/余事([^故])/g],
	['余子萬民',/餘子萬民/g],
	//《訪道語錄》中就有好多不易分別的「餘余」
	//餘則不足道矣 //餘則任習一門 //餘則聽之
	//余則不覺其喧 //余則不然




	/**
	 * 「里」地域詞，比如「鄉里鄉親」的「里」和「里長」的「里」是同表地域關係
	 * 「裏裡」結構詞，宜用「裏」不宜「裡」，或可接受通用「里」，用泛指取代特指，如用「馬」代「白黑紅馬」
	 */
	['裏',/[裡里]/g],
	['里$1',/[裡裏]([程巷坊吏甲正長域社治許數]|有殯)/g],
	['$1里人',/([^房屋])裏人/g],
	['家長里短',/家長[裡裏]短/g],
	['凡里之',/凡[裡裏]之/g],['其里之義',/其[裡裏]之義/g],
	['鄉里',/鄉[裏裡]/g],['$1裏',/(故鄉|家鄉)里/g],['鄉里鄉親',/鄉[裏裡]鄉親/g],['吾鄉我里',/吾鄉我[裏裡]/g],
//['$1裏',/([這那向在城省市縣區村地林房屋廳堂門窗寨宮營陣風雨雪霧水火鏡光聲手目眼鼻耳口心腦頭嘴肚肺肝脾胃腎江河湖海溪井文言話語堆]|渺莽|衣服|世紀|身形)[裡里]/g],
	//['這裏長大','這[裡里]長大'],['這裏長住','這[裡里]長住'],
	['$1里$2',/([這那哪])裏([^頭面邊𨘢])/g],  //['$1裏$2',/([這那哪])里([頭面])/g],
	['$1里',/([故])裏/g],
	['$1里路',/(多少)裏路/g],
	['門裏長',/門[裡里]長/g],
	['這里長住在',/這[裡里]長住在/g],
	['幾里',/[幾几][里裏裡]/g],['古華里',/古華裏/g],
	['$1里',/([一二三四五六七八九十百千萬億數幾多兩廿卅某公英羑半鄰廿卅][多來餘海]*)[裡裏]/],
	['$1裏挑',/([十百千萬])[裡里]挑/g],
	/**音譯用「里」*/
	['歇斯底里',/歇斯底[裏裡]/g],
	['居里夫人',/居[裏裡]夫人/g],
	['$1里',/([馬新]德)[裏裡]/g],
	['$1里',/([哈阿])[裏裡]/g],
	['里$1',/[裏裡]([斯希爾昂奧])/g],
	['格利高里',/格利高[裏裡]/g],
	['克里斯',/克[裏裡]斯/g],
	['亞里士多德',/亞裏士多德/g],



	//['煅燒','[鍛緞]燒'],['煅煉','[鍛緞]煉'],['鍛鍊','[煅緞]鍊'],
	/**
	 *「煅」，小篆無此字。「段」，椎物也，從「殳」。「鍛」，反復椎打所冶之物。
	 *「鍊」者，治之使精。「煉」亦有此意，兼有火候。
	 *「鍛煅」宜從「金」部，「鍊煉」宜從「火」部。
	 */
	'鍛煅',
	'煉鍊',
	//['鍛煉',/[鍛煅][煉鍊練]/g],
	//['煉精化气',/[煉鍊練][精精]化[气氣]/g],['煉气化神',/[煉鍊練][气氣]化神/g],['煉神還虛',/[煉鍊練]神還虛/g],
	//['煉$1',/[煉鍊練]([金銀鋼鐵獄爐精精炁气氣神丹])/g],['$1煉',/([提煆])[煉鍊練]/g],





	/**
	 * 「鬥」動作
	 * 「斗」容器，星斗
	 * */
	 /*
	'鬥斗',
	['星回斗轉',/星回鬥轉/g],
	['斗$1',/鬥([女覆底下呪咒蓋星門極眞宮父母印諱光運杓魁梢量分訣樞中酒建宿罡篷蓬柄笠膽府米降大])/g],
	['斗$1',/鬥(君[^王主上])/g],
	['$1斗$2',/([^纏爭惡決毆戰])鬥([數中])/g],
	['斗$1',/鬥(轉星移|牛女)/g],
	['月犯斗',/月犯鬥/g],
	['$1斗',/([掐貪擲魁履戴呪咒飜禮啟乞召玉請奏飛貫灌玄謝歌運臥漏參跟午雷陰陽拜升昇旋北星南五罡筋牛阿墨泰步熨燙])鬥/g],
	['$1斗',/([一二三四五六七八九十百千萬億數幾多兩廿卅][多來餘]*)鬥/g],
	['$1斗',/(祿存|巨門|廉貞|破軍|武曲|文曲|璇璣|玉樞|九霄|高八|大如|米一|先天|南北二)鬥/g],
	['$1斗',/([驅步轉摘移踏飛紅白黃紫靑青黑][星神云雲雷罡][蓋轉踏謁移換遮步穿躡])鬥/g],
	['$1斗',/(罡.?)鬥/g],['斗$1',/鬥(罡.?)/g],
	['$1斗$2',/([朝])鬥([^陣將爭])/g],
	['斗$1箕',/鬥([\s\S]?)箕/g],['箕$1斗',/箕([\s\S]?)鬥/g],
	//['改斗曆',/改[斗鬥][曆歷]/g],
	['左旋出斗',/左旋出鬥/g],
	['幾斗',/[幾几][鬥斗]/g],
	['日進斗金',/日進鬥金/g],
	['貫$1斗牛',/貫(乎*)鬥牛/g],
	['蛇斗$1',/蛇鬥([于於])/g],
	['斗$1',/鬥([姥姆])/g],
	['大斗小秤',/大鬥小秤/g],
	['大秤小斗',/大秤小鬥/g],
	['秤斗',/秤鬥/g],['斗秤',/鬥秤/g],
	['$1斗',/([^報宣][吿告][劍]?)鬥/g],
	['$1斗$2',/([現降])鬥([^雞鷄气氣])/g],  //開云現斗
	['開云現斗',/開云現鬥/g],
	['鬥$1',/斗(數[萬千百十]*[招里倍次个回合目番刻小時據])/g],
	['鬥$1',/斗([爭死])/g],['$1斗',/([星升])鬥/g],
	['鬥酒$1',/斗酒(會|詠梅|唱曲|談笑)/g],
	['$1鬥酒',/([去要]|找你|高手|和他)斗酒/g],
	['$1鬥中',/([打爭戰纏])斗中/g],
	['黑黑白白鬥分明',/黑黑白白斗分明/g],
	['斗牛宮',/鬥牛宮/g],
	['$1斗牛',/([衝沖貫].?)鬥牛/g],
	['斗爲天之喉舌',/鬥爲天之喉舌/g],
	['鬥气',/斗气/g],['$1斗气',/([取吸北南布])鬥气/g],
	['$1斗$2斗',/[鬥斗]([^智勇心力不的])[鬥斗]([^智勇心力過])/g],
	['$1斗',/([東南西北子丑寅卯辰巳午未申酉戌亥甲乙丙丁戊庚辛壬癸])鬥/g],  //自己鬥[爭獸]
	['斗$1',/鬥([子丑寅卯辰巳午未申酉戌亥甲乙丙丁戊己庚辛壬癸])/g],
	//['$1斗$2',/([^戰爭])鬥([環辛][^境苦]?)/g],
	'鬥鬬鬭𨷖𩰚𩰛閗鬪𩰑𩰒𩰖',
	*/

	//斗魒𩳐魓䰢𩵄𩲃魁柄
	'斗鬥',
	['$1鬥',/([再戈矛去卻要能來曰番欲徒敵邀撩拼搏奮激獨愛好戰決打纏遊游嗜戀酣鏖死久毆狠頑苦賭刁械挑觸亂厭惡武文罷休歇免止解快嚷互角獅虎龍熊宅內])斗/g],
	['$1鬥$2',/([猶])斗([^柄])/g],
	['$1鬥$2',/([人])斗([^中])/g],
	['$1鬥$2',/([外])斗([^光])/g],
	['$1鬥',/([^貪][狼])斗/g],
	//['$1鬥$2',/([^星九神][宮])斗([^府樞罡君])/g],
	['宮鬥$1',/宮斗([劇片戲]|出身)/g],['$1宮鬥',/([玩]|豪門|歷史)宮斗/g],
	['$1鬥',/([跳廝齊])斗/g],
	['$1鬥',/([男女]兒?)斗/g],
	['$1鬥',/([爭耍].?)斗/g],
	['$1鬥',/([與].?)斗/g],
	['鬥$1',/斗([了得脣兮到罷過間兒糖浪戰他你錢財富架兵死戰爭毆智力勇勁志巧豔艷妝妍麗潔青雪霜奇眼目棋卿陣詩詞曲賦歌彩牌角寵羊狗鳥熊獅蛟龍蝦蛐花草艸錦茶葉嘴趴])/g],
	['$1鬥$2',/([^南北])斗([虎])/g],
	['$1鬥$2',/([^大小])斗([殺])/g],
	['$1鬥$2',/([^念誦默寫南北])斗([經])/g],
	['$1鬥$2',/([^蛇北南飛剔入布起一二五九子丑寅卯辰巳午未申酉戌亥陰貪魁])斗([芳翠於于色風][^合])/g],
	//['鬥$1',/斗([仙神魔鬼妖])/g],
	['$1鬥時',/([^步祭降告吿貫踏])斗時/g],
	['鬥$1',/斗(蟋蟀|山歌|地主|惡霸|麻將|多時|鵪鶉|帳香|良久|逍遙|穠華|八股|.{0,2}鳥|魚)/g],
	['鬥$1',/斗([正猶]?[酣])/g],
	['鬥$1',/斗(.?不過)/g],
	['鬥$1',/斗([^蒼][舌])/g],
	['鬥$1一鬥',/[斗鬥]([他你她們上]*)一[斗鬥]/g],
	['$1鬥$2',/([^南北])斗([个個不分]{0,3}[勝負敗])/g],
	['鬥$1',/斗([份分]子)/g],
	['$1鬥$2',/([^南北])斗([不無未有至]?[十]?[數一二三四五六七八九萬千百十兩]+餘?[招里倍次个回合目番刻小時據])/g],
	['$1鬥$2',/([跟和與在][^坎南北一乎])斗([^牛])/g],
	['$1鬥',/([扯行]且)斗/g],
	['窩裏鬥',/窩[裏裡里]斗/g],
	//['之鬥$1',/之斗([^柄])/g],
	['$1之鬥',/(生死|困獸|無益|負隅|這場|龍)之斗/g],
	['相鬥$1',/相斗([^樞柄辰])/g],
	['格鬥$1',/格斗([^樞柄辰呪咒])/g],
	['$1鬥倒',/([^北南璇璣])斗倒/g],
	['$1鬥劍',/([^五降])斗劍/g],
	['$1鬥將',/([^一履擲飛北南告吿])斗將/g],
	['$1鬥士',/([^光遮])斗士/g],
	['$1鬥法',/([^禮拜衣席步臥謁建朝之躡])斗法/g],
	['$1鬥口',/(小兒|婦孺|莫)斗口/g],
	['$1鬥牛$2',/([^起衝沖呪咒起塞罡貫乎方妖])斗牛([^\s女之宮])/g],
	['$1鬥气$2',/([^取吸北南布存塗])斗[气氣]([^宮布灌入吹])/g],
	['$1鬥酒$2',/([^一二三四五六七八九十])斗酒([^一二三四五六七八九十])/g],
	['鬥起禍',/斗起禍/g],
	['鬥木獬',/斗木([檞獬])/g],
	['鬥在一$1',/斗在一([處起塊])/g],
	['鬥斗牛',/[鬥斗][鬥斗]牛/g],
	['黑黑白白鬥分明',/黑黑白白斗分明/g],
	['鬥个旗鼓相當',/斗个旗鼓相當/g],
	['鬥得旗鼓相當',/斗[得的地]旗鼓相當/g],
	['二牛鬥',/二牛斗/g],
	['吳越鬥',/吳越斗/g],
	['鬥馬超',/斗馬超/g],
	['鬥至$1',/斗至(天.?晚)/g],
	['鬥鷄',/[鬥斗][鷄雞]/g],
	['$1鬥$2',/(\s觀)斗(\s)/],  //這個詞歧義多，暫定如此
	['往鬥之',/往斗之/g],
	['勾陳克日刑沖鬥',/勾陳克日刑沖斗/g],
	['鬥不鬥',/斗不斗/g],
	['救鬥者',/救斗者/g],
	['不$1則鬥',/不(足|得已)則斗/g],
	['$1鬥',/([家私疾不]|气實則|鼓行交|戰者必|人之|拚死一|怒則)斗/g],
	['鬥$1',/斗([訟喧鬧打]|象棋|欲齊|則得|則卒吏相救|必三族相殘)/g],
	['若牛鬥',/若牛斗/g],




	/**
	 * 「長尾爲鳥，短尾爲隹」
	 * 故而「公鷄母雞」
	 */
	['$1鷄',/([公雄])[雞鸡]/g],
	['$1雞',/([母牝覆])[鷄鸡]/g],
	['雞$1',/[鷄鸡]([子卵蛋])/g],
	['雞$1',/[鷄鸡]([覆][子])/g],

	['鬥鷄',/[鬥斗][鷄雞]/g],


	'志誌',
	['誌$1',/志([異怪略畧書])/g],['縣誌',/[縣县]志/g],
	['$1誌',/([山地方鄉村雜標略畧別日通府州史郡省市])志/g],
	['$1誌',/(三國|七國|九國|東周列國|蕩寇|徐偃王|高閭燕|广陵妖亂|翰林|江表|建炎進退|錢氏私|玉照新|歸潛|大金國|建譜|倭|鹽邑|吳淞甲乙倭變|金山倭變小|大同平叛|錦衣|星變|張司馬定浙二亂|酌中|恩卹諸公|延綏鎭|平寇|先撥|承天大|建州私|金川妖姬|臺灣小|殛珅|蒙寇|湘軍|海虞賊亂|木壽杌近|華陽國|成都|革朝|酌中|靖海|百可漫|過墟|三山|新安|鎮江|四明|亳州|臨汀|廈門|壽寧待|海國圖|金陵瑣|臺灣|地理|區域|[東南西北中]嶽)志/g],
	['顯誌堂',/顯志堂/g],
	['志$1',/誌([願向气意趣士學喜哀])/g],
	['$1志',/([永鬥長心無失喪立有之壯爲異遠奪意]|專心致)誌/g],
	['鬥志',/[鬥斗][志誌]/g],



	/**小篆似無「註」字，自明人始用。待查
	'注註',
	['註$1',/注([曰明解腳疏])/g],
	['$1註',/([題旁腳])注/g],
	*/

	['澹$1',/淡([臺云月蕩慮乎])/g],
	['水澹澹','水淡淡'],['水何澹澹','水何淡淡'],
	['淡而無味',/澹而無味/g],


	/**
	 * 「游」只用于姓氏，以及與水相關
	 * 「遊」
	 */
	'遊游',
	['游$1',/遊([水泳船艇])/g],['游$1',/遊(上岸|過去)/g],
	['$1游',/([上下浮洄鳧])遊/g],
	//['中游','中遊'],
	['$1游',/([水江河湖海溪澗].{0,2}中)遊/g],
	['善游者',/善遊者/g],['者善游',/者善遊/g],['能游者',/能遊者/g],
	['$1善游',/([𨿽遽較敖])善遊/g],
	['$1善游',/(越人|便騎|其父)善遊/g],
	['水裏游',/水[裏裡里][游遊]/g],
	['$1遊',/([妄東南西北優悠雲云嬉閒窮旅神魂悅出遍徧遨])游/g],
	['遊$1',/游([心志遍徧民牧意思移情子女說戲人蕩走僧道神仙行玩翫興賞來去])/g],
	['遊後',/[遊游][後后]/g],  //似無姓游的皇后
	['姓游','姓遊'],
	['游來游去',/[游遊]來[游遊]去/g],
	['$1遊$2',/([上中下])游([於于])/g],




	/**
	 * 「卷」名詞或量詞或形容詞
	 * 「捲」動詞
	 */
	'捲卷',
	['$1卷',/([一二三四五六七八九十百千萬數幾兩廿卅][多來餘]*)捲/g],
	['$1卷',/([\d]+)捲/g],
	['$1卷',/([破寶分皮文本調手首黃割正讀薦繳草艸投白釋授受閱詩前後此古後微上中下書驗封蛋春膠花放落發點出髮開閉收交遞案朱題誊糊掩答寫試考問評長畫墨經某篇])捲/g],
	['$1卷',/([各])捲/g],  //可能會有歧義：各卷目錄，各捲鋪蓋走人
	['$1卷',/(鋪[蓋葢]|行李|丹書鐵)捲/g],
	['卷$1',/捲([第之]*[上中下一二三四五六七八九十百千萬廿卅])/g],
	['卷$1',/捲([第之]*[\d])/g],
	['卷$1',/捲([終數子詩書字畫首中末名宗軸幅帙餅髮曲毛筒刃刄花紙煙])/g],
	['卷$1',/捲([A-Za-z])/g],
	['龍卷風',/龍捲風/g],
	['法卷$1',/法捲([^起])/g],//得授法卷。施法捲起水柱（可能會出現在小說裏）。



	/**
	 * 「發」動作
	 * 「髮」頭髮
	 * */
	'發发',
	['頭上曰髮',/頭上曰[發发]/g],['頭上沒髮',/頭上沒[發发]/g],['無須無髮',/無須無[發发]/g],
	['髮$1',/[發发]([梳際齒須絲髻鬌根辮稍廊梢])/g],
	['髮$1',/[發发]([夾][^脊])/g],
	['$1髮小',/([^研開])[發发]小/g],
	['$1髮$2',/([^候待])[發发]([卷])/g],
	['髮$1',/[發发](如雪|神蒼華)/g],
	['$1髮',/([紺假挽梳脫膚齒沐浴濯素銀洗剪吹漂飄逸掉染鶴絲落截卷盤編辮赤眉紅黃黑白金長短鬢毫鬈留畱削蓄結亂須毛燙披])[發发]/g],
	['洗發智慧',/洗髮智慧/g],
	['$1髮$2',/([被])[發发]([^現射配布向])/g],
	['$1髮$2',/([斷])[發发]([^射])/g],
	['$1髮$2',/([束])[發发]([^射])/g],
	['$1髮$2',/([頭])[發发]([^展生楞配])/g],
	['$1髮$2',/([齒])[發发]([^黃黑白])/g],
	['$1髮',/([髯].?)[發发]/g],
	['$1髮',/([眉牙齒]疏)[發发]/g],
	['$1髮$2',/([^腠][理])[發发]([^生])/g],
	['$1髮',/(頭秀|的秀|披頭散|千鈞一|心細如|[間閒]不容|牽一)[發发]/g],
	['$1髮式',/([^啓驟爆])[發发]式/g],
	['髮$1',/[發发]([剃])/g],
	['蒼華髮神',/蒼華發神/g],
	//['髮神',/發神/g],['發神經',/髮神經/g],
	//['齒發$1',/齒髮([黃黑白])/g],
	['髮$1',/[發发]([型])/g],['$1發型號',/([研開])[髮发]型號/g],
	['生華髮',/生華[發发]/g],
	['發$1',/[髮发]([揮明現酵威笑放展話言出嘆歎動])/g],
	['發$1',/[髮发](牢騷|个|下來|向瑤盤)/g],
	//['悶頭發展',/悶頭[髮发]展/g],['摸頭發楞',/摸頭[髮发]楞/g],['街頭發生',/街頭[髮发]生/g],['被發配',/被[髮发]配/g],
	['明白發生',/明白[髮发]生/g],['兄長發到',/兄長[髮发]到/g],
	['$1發',/([打]|念頭|[面色]赤)[髮发]/g],
	['發$1',/髮([誓麻熱表])/g],
	//['剃髮出','剃發出'],
	['剃髮',/剃發/g],
	['不斷發生','不斷髮生'],
	['須發$1汗',/須髮(.{0,1})汗/g],
	['發而爲汗',/髮而爲汗/g],
	['烏黑發亮',/烏黑髮亮/g],
	'髮髪',



	/**
	 * 「升昇」
	 */
	/*
	'昇陹升',
	['$1升',/([壹幾數一二三四五六七八九十])昇/g],
	//*/


	/**
	 * 「丑」地支之一
	 * 「醜」形容詞
	 * */
	'醜丑',
	['丑$1',/醜(之*[分位地土卦未寅午年月日時歲建初末中後始終春夏秋冬])/g],
	['丑$1',/醜(者上屬乎|之大呂)/g],
	['$1丑',/([寅艮建至乙丁己辛癸子]|巳酉|子與|地[辟闢]于|養于|午逆旋到|罡星指)醜/g],
	['從丑到寅',/從醜到寅/g],
//	['子﹑丑﹑寅','子﹑醜﹑寅'],
	['$1丑',/([化財鬼卦爻世應年月日時生旺墓絕沖和子寅卯辰巳午未申酉戌亥乙丁己辛癸].{0,3})醜/g],
	['丑$1',/醜(.{0,3}[牛土宮方父子兄財鬼卦爻世應年月日時生旺墓絕沖和子寅卯辰巳午未申酉戌亥])/g],
	['公孫丑','公孫醜'],
	['文丑','文醜'],
	['二陽丑',/二陽醜/g],
	['醜$1',/丑([形聞男女婦惡甚陋角名心語行事態臉貌顏])/g],
	['醜$1',/丑(和尙)/g],
	['$1醜',/([狀譏小張孟陽至凶凡名武文可丟四九女家臉面貌顏妍魔奇])丑/g],
	['醜$1醜',/[醜丑]([自歸𨿽便])[醜丑]/g],
	['出醜$1',/出丑([^土父母兄弟妻財官鬼子孫寅訣方])/g],
//	['醜$1',/丑(之*[名陋事態鬼曰心甚﹕﹐。])/g],
//	['$1醜',/([出凶凡名小武文可丟四九女家顏妍魔奇]|獻了*|西洋)丑/g],



	/**
	 * 「干」加以外力使之發生關系。主干道，主干綫，讀平聲。
	 * 「乾」八卦之一
	 * 「幹」做事
	 * 「漧」說文小篆無此字，但「漧旱」宜用「漧」
	 * 「漧淨」與「干淨」：不知此詞的源起，從詞意，涉及關系的用「干淨」，涉及水酒的用「漧淨」
	 * 「漧脆」：不知此詞源起，形容物品的漧燥用「漧脆」，形容人的性格行爲，卽使使用「干脆」仍然不是此詞各字所能表達的
	 */
	'幹干',
	///漧
	['$1漧',/([果])[干幹乾榦]/g],['果幹剛鷙',/果[乾漧干]剛鷙/g],['果幹有气力',/果[乾漧干]有气力/g],['魁偉果幹',/魁偉果[乾漧干]/g],['憐其果幹',/憐其果[乾漧干]/g],
	['漧$1',/[乾幹干榦]([冰槁草艸墨屍尸咽嚥醋咳嘔吐哭笑漆瘦癟旱脆澀枯飯渴服桃李棗癟裂燥涸柴黃土處薑蘇葛糧菜])/g],
	['漧$1',/[乾幹干榦]([巴])/g],
	['漧$1',/[乾幹干榦](地黃)/g],
	['漧$1',/[乾幹干榦](.?[澀燥])/g],
	['墨$1漧',/墨(.{0,2})[乾幹干榦]/g],
	//['無漧$1',/無[乾幹干]([者則])/g],
	['$1漧',/([弄海水掃揩吸吮焦瀝擦抹拭蒸暴曝嗌口舌咽嚥旱枯腳頭擠搾榨甩擰風薰吹流晾曬陰焙烘肉餅魚蝦蟶蛤])[乾幹干榦]/g],
	['$1漧',/([烤].{0,2})[乾幹干榦]/g],
	['$1漧',/(乳臭未)[乾幹干榦]/g],
	['$1不漧',/([濕汁瘡血])不[乾幹干榦]/g],
	['$1發漧',/([口喉咽脣唇䫃])[發髮][乾幹干榦]/g],
	['$1發漧',/(舌頭|嘴巴)[發髮][乾幹干榦]/g],
	['$1漧$2',/(抽.{0,2})[乾幹干榦]([^坤離])/g],
	['外彊中漧',/外彊中[乾幹干榦]/g],
//	['$1漧淨',/([舔拭擦洗刷抹喫喝收拾漱沖].{0,2})[干幹乾榦][淨浄]/g],
	['漧淨',/[干幹乾榦][淨浄]/g],
//	['$1漧漧淨淨',/([舔拭擦洗刷抹喫喝收拾漱沖].{1,2})[幹榦乾漧干][幹榦乾漧干][淨浄][淨浄]/g],
	['漧漧淨淨',/[幹榦乾漧干][幹榦乾漧干][淨浄][淨浄]/g],
//	['漧淨$1',/[干幹乾榦][淨浄](.{0,2}[衣服鞋])/g],
	['漧$1',/[干幹乾榦](.?燥)/g],
	['$1漧了',/([酒水墨].{0,5})[幹榦乾干]了/g],
	['漧$1',/[干幹乾榦](蘑菇|纖維)/g],
	///乾
	['乾爲天',/[幹漧干榦]爲天/g],
	['乾$1',/[幹漧干榦]([爻位宮坤震父天心化居符造宅元剛方首施象啟鈞道雷岡綱曜輝])/g],  //「乾父」或因上下文有歧義
	//['乾索坤',/[幹漧干]索坤/g],
	['乾$1',/[幹漧干榦](.{0,2}[坤])/g],
	['$1乾',/([坤].{0,2})[幹漧干榦]/g],
	['一坤$1一乾',/一坤(.{0,2})一[幹漧干榦]/g],
	['朝乾夕惕',/朝[幹漧干榦]夕惕/g],
	['六陽之乾',/六陽之[幹漧干榦]/g],
	//['上乾下$1',/上[干幹漧]下([乾坤震坎艮巽離兌])/g],['上$1下乾',/上([乾坤震坎艮巽離兌])下[干幹漧]/g],
	['乾$1',/[幹漧干榦](.{0,2}[乾坤震坎艮巽離兌])/g],['$1乾',/([乾坤震坎艮巽離兌].{0,2})[干幹漧]/g],
	['上乾下乾',/上[幹漧干榦]下[幹漧干榦]/g],
	['$1乾',/([^單][純])[幹漧干榦]/g],  //['單純幹',/單純乾/g],
	['先天乾$1',/先天[幹漧干榦]([性體元金])/g],
	['後天乾居西北',/後天[幹漧干榦]居西北/g],
	['乾$1',/[幹漧干](天門|道生男|天罡|天坤地|天靈火|天太乙|天一元|天大自精金|天眞火|天火靈珠|天混元珠|天純陽眞火|天烈火|天純陽之火|天之火|天神雷)/g],
	['坤比乾',/坤比[幹漧干榦]/g],
	['鉛盡汞乾',/鉛盡汞[干幹榦漧]/g],  ///按理應是「盡」「漧」對偶，可是「鉛性乾」方符合原旨，當是用「乾」
	['鉛性乾',/鉛性[干幹乾榦]/g],  //鉛性乾
	['鉛乾汞',/鉛[干幹漧榦]汞/g],
	['乾外汞',/[干幹漧榦]外汞/g],
	///榦
	['主榦$1',/主[幹乾漧干]([^道綫])/g],  //主干道：主要的和其他的有關系的道路
	['榦枝','乾枝'],['擔乾枝','擔榦枝'],
	['榦弱枝',/[乾漧干幹]弱枝/g],
	['$1榦',/([骨枝樹])[乾漧干幹]/g],
	['榦$1',/[乾漧干幹](.{0,2}[枝葉])/g],
	['木之有榦',/木之有[乾漧干幹]/g],
	['榦$1',/[乾漧干幹](.?末)/g],
	///干
	//['$1干干淨淨',/([^舔拭擦洗刷抹喫喝收拾][^舔拭擦洗刷抹喫喝收拾].{0,2})[幹榦乾漧干][幹榦乾漧干][淨浄][淨浄]/g],
	//['$1干淨',/([^舔拭擦洗刷抹喫喝收拾][^舔拭擦洗刷抹喫喝收拾].{0,2})[幹榦乾漧干][淨浄]/g],
	///有關系用「干」所以用「干淨」
	['$1干干淨淨',/([撇].{0,2})[幹榦乾漧干][幹榦乾漧干][淨浄][淨浄]/g],
	['干干淨淨$1',/[幹榦乾漧干][幹榦乾漧干][淨浄][淨浄](.?脫身)/g],
	['$1干淨',/([撇].{0,2})[幹榦乾漧干][淨浄]/g],
	['以干$1',/以[幹乾漧榦]([^木柴坤道爲索得的地])/g],  ///「是以乾坤者」「以乾道索坤道」
	//「下官故炁﹐不得妄干。」「魔試之干」「事干利濟」「合干官屬」合幹眞司」「但干考校拘囚之所」「某干不能侵」
	['$1干$2',/([妄但某])[幹乾漧榦]([^坤])/g],
	['$1干$2',/([合])[幹乾漧榦]([^坤])/g],
	['$1干$2',/([^沒有][事])[幹乾漧榦]([^坤得不])/g],
	['$1干$2',/([應])[幹乾漧榦]([^坤])/g],  //「應干施用」「應干主者」
	['魔試之干',/魔試之[幹乾漧榦]/g],
	['$1不干',/(外侮|外事|魔障|邪祟|邪穢)不[幹乾漧榦]/g],
	['陰來干陽',/陰來[幹榦乾漧]陽/g],
	['主干$1',/主[幹榦乾漧]([道綫])/g],  ///乾道生男
	['干$1',/[幹榦乾漧]([綫])/g],
	['干$1',/[幹榦乾漧]([試看瞪坐站躺等杯政爭害休云言支親爺爹娘爸媽女兒孫侄己戚戈羽革戎係系涉擾預橹國紀惹觸淩典命行戾瀆名求謁進請賞酒犯冒])/g],  //索
	['干$1',/[幹榦乾漧]([心][﹐]?[^也])/g],  //乾心也
	['干$1',/[幹榦乾漧]([累][^了])/g],
	['干$1',/[幹榦乾漧](將莫邪)/g],
	['干$1',/[幹榦乾漧](天地綱紀之常|天之*[和忌威位戮相怒禍常條]|我[甚屁]*事|瞪眼)/g],
	['干$1',/[幹榦乾漧](了.{0,2}[口杯碗缸酒])/g],
	['闌干',/闌幹/g],
	['$1干',/([十一若何返相上無])[幹榦乾漧]/g],
	['$1干',/([非])[幹榦乾漧]/g],
	['$1干$2',/([天])[幹榦乾漧]([^金元])/g],
	['$1干$2',/([不])[幹榦乾漧]([我你他她吾汝伊].?事)/g],
	['天干地支',/天[幹乾漧榦]地支/g],
	['老$1干',/老([白])[幹乾漧榦]/g],
	['干$1戈',/[幹乾漧榦](.?)戈/g],
	['干$1',/[幹乾漧榦](生受)/g],
	['$1干合處',/([陰陽])[幹乾漧榦]合處/g],
	['比干',/比[幹乾漧榦]/g],
	['陽干陰',/陽[幹乾漧榦]陰/g],
	['陰干陽',/陰[幹乾漧榦]陽/g],
	['干世亂而卒不決',/[幹乾漧榦]世亂而卒不決/g],
	['干正紊眞',/[幹乾漧榦]正紊眞/g],


	/**
	 * 「姜」姓
	 * 「薑」植物
	 */
	['漧薑',/[乾幹干][姜薑]/g],
	['生薑',/生姜/g],
	['薑$1',/姜([汁糖末粉水])/g],

	/**
	 * 奉「丵」爲「菐」
	 * 事「菐」者「僕」
	 */
	['僕$1',/仆([從役人])/g],
	['$1僕',/([忠奴男女])仆/g],


	//['征戰','徵戰'],
	//['出征','出徵'],
	//['徵狀','征狀'],

	/**
	 * 「復」動詞
	 * 「複」形容詞
	 */
	'復复',
	['復',/[複复]/g],
	['復$1',/[複复]([計蘇諫射爲立至入因會])/g],
	['$1復',/([修匡豈已不亦回無答荅收])[複复]/g],
	//['複$1',/[復复]([數].{0,2}[^年月日時旬])/g],
	['複$1',/[復复]([雜])/g],
	['繁複',/繁[復复]/g],['有重複',/有重[復复]/g],

	/**
	 * 「曆」名詞，時間曆法相關
	 * 「歷」動作
	 */
	'歷历',
	['$1歷',/([經治病來])[曆暦历歴]/g],
	['歷$1',/[曆暦历歴]([來經年代聖紀元])/g],
	['$1曆',/([司慶萬永陽陰農黃律玉年殷周夏舊新西公]|元辰|五星|泰始|景初|甲子元|崇天|戊寅|四分)[暦歷歴历]/g],
	['日曆$1',/日[暦歷歴历]([^險])/g],
	['歷$1',/[曆暦历歴]([史代])/g],
	['天文曆$1',/天文[暦歷歴历]([法數])/g],
	['曆$1',/[暦歷歴历]([書術])/g],
	['斗曆',/[斗鬥][曆暦歷歴历]/g],['鬥歷$1',/[鬥斗][曆暦歷歴历]([一二三四五六七八九十]{1,2}[年刻])/g],['旋斗歷箕',/旋斗曆箕/g],
	['轉斗歷炎涼',/轉鬥歷炎涼/g],
	['曆有十二辰',/[暦歷歴历]有十二辰/g],
	['曆家立表以測日冕',/[暦歷歴历]家立表以測日冕/g],


	['好鬥分子',/好斗分子/g],['爭鬥分明',/爭斗分明/g],['黑黑白白鬥分明',/黑黑白白斗分明/g],


	/**
	 * 「臟」內臟
	 * 「髒」形容詞，不潔不淨
	 * 「𧷢」非法獲得物
	 */
	['贓$1',/[臟髒賍脏]([錢銀物款])/g],
	['$1贓',/([貪分賊窩銷收栽])[臟髒賍脏]/g],
	['$1贓',/(栽.{0,2})[臟髒賍脏]/g],
	['栽贓$1陷',/栽[髒臟贓脏]([污汙])陷/g],
	['臟$1',/[髒贓賍脏]([腑器])/g],
	['$1臟',/([一五內心腎肝脾肺腑])[髒贓賍脏]/g],
	['五月分臟',/五月分[髒贓賍脏]/g],
	['髒$1',/[臟贓脏]([亂話污汙]|東西)/g],
	['$1髒',/([錢很骯弄])[臟贓脏]/g],
	['潑髒水',/潑[臟贓脏]水/g],
	['$1髒水',/(這盆*)[臟贓脏]水/g],
	['髒$1',/[臟贓脏](水.{0,2}潑)/g],
	'髒脏', //剩下的「脏」默認轉「髒」



	/**
	 * 「面」臉部，引申爲事物的外表
	 * 「麵」食物
	 */
	'面麵',
	 //素麵：食物。素面：面部沒有使用化妝品。
	['$1麵',/([藥葯蛋鹹鹼碗發揉撈食喫米麥湯炒煮壽炸抻拌])[面]/g],
	['$1麵',/(刀削|牛肉|烏冬|陽春|蘭州拉|方便|福州綫|蕎麥|油潑|炸醬)[面]/g],
	['麵$1',/[面]([點店館攤粉湯糊團條筋餅食片包])/g],
	['面$1',/麵([生臨前聖壁市晤命友額世巾子積試目龐部色孔巾談議])/g],
	['$1面',/([負東南西北人馬表明暗市要好世當顏片地正反全蒙吹頭版有平曲弧位前後切斷吹迎上下左右臉丟落遮露外赤雙多截斜陰陽鬼鐵青靑一二兩四八六十見會])麵/g],

	['點綫面',/點綫麵/g],
	['裏面',/[裏里裡][面麵]/g],


	/**
	 * 羊多則「羴」味重
	 * 魚生則「鮏」味濃
	 */
	['羴$1',/[膻羶]([气味臭])/g],
	['鮏羴',/([腥鯹鮏])[膻羶]/g],
	['$1鮏',/([魚偷貪])[腥鯹]/g],
	['鮏$1',/[腥鯹]([气味臭])/g],
	//'羶羴','鯹鮏',

	/**
	 * 「沈沉」：「沉」小篆爲「沈」，作姓氏用「沈」，或可皆用「沈」
	 */
	//['沉$1',/沈([沉沈思屙痾重着著靜入香甸淀積])/g],
	//['$1沉',/([沉沈太])沈/g],


	/**
	 * 「屍」：死屍，會意字。
	 * 「尸」：躺尸，象形字。
	 * 此尸神象。「三尸」：上尸彭倨，中尸彭質，下尸彭矯。尸位素餐。行尸走肉。挺尸啊。
	 * 「尸」本意當與身體相關，只不知與「身」部差異是什麼。
	 * 或者，「尸」部的字，指佔據身體內但可以排出的一部分，這部分是無用甚至有害的。如：屁尿屎
	 * 究竟爲什麼用「尸」部？
	 * 「屈」「躬」都可以指身體彎曲
	 */
	/*
	'尸屍',
	['殭屍',/[殭僵][屍尸]/g],
	['屍殭',/[屍尸][殭僵]/g],
	['$1屍',/([藏伏眠裹浮沈沉陳男女殘狼焦腐收血全借化死喪漧暴曝裸鞭戮辱拋棄背焚毀分碎驗剖縫斂煉趕養法鐵銅銀金])尸/g],
	['伏其屍',/伏其尸/g],
	['屍$1',/尸([水臭气氣炁王骸體骨首身變斑諫])/g],
	['死要見屍',/死要見尸/g],['屍橫遍野',/尸橫遍野/g],['橫屍遍野',/橫尸遍野/g],
	['$1屍',/(分.{1,2})尸/g],
	['奸屍',/[奸姦][屍尸]/g],
	//*/
	'屍尸',
	['$1尸',/([三上中下])屍/g],
	['尸$1',/屍([殼居解饔位羅盟祭])/g],
	['尸$1',/屍([子][^孫])/g],
	['$1尸$2',/([^偷偸盜])屍([賊])/g],
	['$1尸之',/([^死])屍之/g],
	['尸$1',/屍(天子)/g],
	['尸$1',/屍(.?神祝)/g],
	['$1尸',/([躺挺])屍/g],
	['寢不尸',/寢不屍/g],
	['行尸走肉',/行屍走肉/g],
	['載尸以行',/載屍以行/g],
	['載尸集戰',/載屍集戰/g],
	['皇尸載起',/皇屍載起/g],
	['鼓鐘送尸',/鼓鐘送屍/g],
	['尸佉落迦經',/屍佉落迦經/g],
	['拖尸帶骨',/拖屍帶骨/g],



	['怒髮衝冠',/怒[髮發][衝沖冲]冠/g],



	/**
	 * 多數情況下都用「證」。用「登」聲旁，也符合方言的韻母。
	 * 「証」，諫也。
	 */
	//'證証',
	['證$1',/証([驗明據實道聖])/g],
	['証$1',/證([之諫])/g],


	/**
	 * 雲：姓，需自動識別人名的功能
	 * 云：言語，需自動識別人名、書名等
	 */
	'云雲',
	['雲$1',/云([煙帆從姓氏家府貴裏氣月气炁朵團彩霞集飄際霄霽海層路蹤遊笈篆紋])/g],
	['雲$1',/云([龍峯村莊溪巢臺林泉鬆松])/g],
	['雲$1',/云([叟山峨幻棲門中杜蕉谷谿麓光山謠巖麓宮走])/g],
	//仙陽//縱云陽生
	['雲$1',/云([橫起濤])/g],
	['雲$1',/云([南貴])/g],
	['雲$1',/云(收雨歇|開霧散|開待月明|生足下)/g],
	['$1雲$2',/([^又》﹕])云(天[^竺癸])/g],
	['雲$1',/云(.?[雨水霧])/g],
	['$1雲',/([星愁起晴晴片朵嶺祥彩好遊姓行停興飄煙風多薄纖陰火烏靑青黑紅白浮閒層乘騰駕爬踏])云/g],
	['$1雲',/([迷水躡])云/g],
	['$1雲',/([碧樵縉繡躋妙密燮竹牧聚鼎耨絳棲])云/g],

	['$1雲',/(塵埃|蘑菇|筋斗|萬里無|舒[捲卷]如|從[之者]如)云/g],
	['$1雲',/(如)云/g],
	['$1雲',/(雨.?)云/g],
	['$1雲$2',/([野])云([^云])/g],
	['雲長',/云長/g],['$1雲',/([趙陳嶽])云/g],
	['$1雲',/(姓[趙陳嶽].?名)云/g],
	//['雲藏山嶽',/云藏山嶽/g], //山嶽藏雲天地肅
	['雲$1',/云([藏輪])/g],
	['$1雲',/([藏])云/g],
	['雲$1',/云([牙中]子)/g],
	/*
	['$1云',/([》古復師誰偈猥若所願案按旣經典詩又勿]|[老莊孫孔孟尸邵]子|聖人|先賢)雲/g],
	['云$1',/雲([﹕何])/g],
	*/


	/**
	 * 考
	 * 攷
	 */
	/*
	'攷考',
	['考$',/攷([妣])/],
	['$考',/([老壽皇])攷/],
	*/



];



/**
 * 分卷標題起新行
 */
const sectionT = [

	['$1\n\n',/(\s*第[一二三四五六七八九十百千萬]+[卷篇章節回])/g],
	['$1「',/([曰云言])[﹕﹐]「/g]

];



/**
 * 字母數字混編的字串用半角
 */
const abcT = [
	['$1_$2',/([A-Za-z]+)\s+([A-Za-z]+)/g],  ///英文單詞間使用下劃綫連接

	['$1A',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ａ/g],['$1B',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｂ/g],['$1C',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｃ/g],['$1D',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｄ/g],['$1E',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｅ/g],['$1F',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｆ/g],['$1G',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｇ/g],['$1H',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｈ/g],['$1I',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｉ/g],['$1J',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｊ/g],['$1K',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｋ/g],['$1L',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｌ/g],['$1M',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｍ/g],['$1N',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｎ/g],['$1O',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｏ/g],['$1P',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｐ/g],['$1Q',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｑ/g],['$1R',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｒ/g],['$1S',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｓ/g],['$1T',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｔ/g],['$1U',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｕ/g],['$1V',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｖ/g],['$1W',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｗ/g],['$1X',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｘ/g],['$1Y',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｙ/g],['$1Z',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)Ｚ/g],

	['A$1',/Ａ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['B$1',/Ｂ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['C$1',/Ｃ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['D$1',/Ｄ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['E$1',/Ｅ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['F$1',/Ｆ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['G$1',/Ｇ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['H$1',/Ｈ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['I$1',/Ｉ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['J$1',/Ｊ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['K$1',/Ｋ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['L$1',/Ｌ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['M$1',/Ｍ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['N$1',/Ｎ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['O$1',/Ｏ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['P$1',/Ｐ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['Q$1',/Ｑ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['R$1',/Ｒ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['S$1',/Ｓ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['T$1',/Ｔ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['U$1',/Ｕ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['V$1',/Ｖ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['W$1',/Ｗ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['X$1',/Ｘ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['Y$1',/Ｙ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['Z$1',/Ｚ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],

	['$1a',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ａ/g],['$1b',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｂ/g],['$1c',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｃ/g],['$1d',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｄ/g],['$1e',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｅ/g],['$1f',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｆ/g],['$1g',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｇ/g],['$1h',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｈ/g],['$1i',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｉ/g],['$1j',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｊ/g],['$1k',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｋ/g],['$1l',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｌ/g],['$1m',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｍ/g],['$1n',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｎ/g],['$1o',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｏ/g],['$1p',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｐ/g],['$1q',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｑ/g],['$1r',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｒ/g],['$1s',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｓ/g],['$1t',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｔ/g],['$1u',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｕ/g],['$1v',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｖ/g],['$1w',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｗ/g],['$1x',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｘ/g],['$1y',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｙ/g],['$1z',/([零一二三四五六七八九十０-９0-9]+[Ａ-Ｚａ-ｚA-Za-z]*)ｚ/g],

	['a$1',/ａ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['b$1',/ｂ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['c$1',/ｃ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['d$1',/ｄ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['e$1',/ｅ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['f$1',/ｆ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['g$1',/ｇ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['h$1',/ｈ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['i$1',/ｉ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['j$1',/ｊ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['k$1',/ｋ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['l$1',/ｌ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['m$1',/ｍ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['n$1',/ｎ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['o$1',/ｏ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['p$1',/ｐ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['q$1',/ｑ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['r$1',/ｒ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['s$1',/ｓ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['t$1',/ｔ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['u$1',/ｕ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['v$1',/ｖ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['w$1',/ｗ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['x$1',/ｘ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['y$1',/ｙ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],['z$1',/ｚ([Ａ-Ｚａ-ｚA-Za-z]*[零一二三四五六七八九十０-９0-9]+)/g],

	['$10',/([A-Za-z0-9]+)[０零〇]/g],['$11',/([A-Za-z0-9]+)[１一]/g],['$12',/([A-Za-z0-9]+)[２二]/g],['$13',/([A-Za-z0-9]+)[３三]/g],['$14',/([A-Za-z0-9]+)[４四]/g],['$15',/([A-Za-z0-9]+)[５五]/g],['$16',/([A-Za-z0-9]+)[６六]/g],['$17',/([A-Za-z0-9]+)[７七]/g],['$18',/([A-Za-z0-9]+)[８八]/g],['$19',/([A-Za-z0-9]+)[９九]/g],

	['0$1',/[０零〇]([A-Za-z0-9]+)/g],['1$1',/[１一]([A-Za-z0-9]+)/g],['2$1',/[２二]([A-Za-z0-9]+)/g],['3$1',/[３三]([A-Za-z0-9]+)/g],['4$1',/[４四]([A-Za-z0-9]+)/g],['5$1',/[５五]([A-Za-z0-9]+)/g],['6$1',/[６六]([A-Za-z0-9]+)/g],['7$1',/[７七]([A-Za-z0-9]+)/g],['8$1',/[８八]([A-Za-z0-9]+)/g],['9$1',/[９九]([A-Za-z0-9]+)/g],


//	'𝘈A','𝘉B','𝘊C','𝘋D','𝘌E','𝘍F','𝘎G','𝘏H','𝘐I','𝘑J','𝘒K','𝘓L','𝘔M','𝘕N','𝘖O','𝘗P','𝘘Q','𝘙R','𝘚S','𝘛T','𝘜U','𝘝V','𝘞W','𝘟X','𝘠Y','𝘡Z','𝘢a','𝘣b','𝘤c','𝘥d','𝘦e','𝘧f','𝘨g','𝘩h','𝘪i','𝘫j','𝘬k','𝘭l','𝘮m','𝘯n','𝘰o','𝘱p','𝘲q','𝘳r','𝘴s','𝘵t','𝘶u','𝘷v','𝘸w','𝘹x','𝘺y','𝘻z',
];


const symbolT = [
	['',' '],['□','▉'],['「','“'],['」','”'],['『','‘'],['』','’'],['﹑','、'],
	['﹨','＼'],['﹕','：'],['。','﹒','．'],
	['﹟','[·＃‧]',/\#/],['﹠','[＆]',/\&/],['﹩','[＄]',/\$/],['﹫','[＠]',/\@/],
	['﹢','[＋]',/\+/],['﹣','[－]',/\-/],['﹡','[＊]',/\*/],['﹪','％',/\%/],
	['﹤','[＜]',/\</],['﹥','[＞]',/\>/],['﹦','[＝]',/\=/],
	['﹐','，',/\,/],['﹔','；',/\;/],
	['﹖','？',/\?/],['﹗','！',/\!/],
	['﹛','｛',/\{/],['﹜','｝',/\}/],['﹝','[〈〔［（]',/[\[\(]/g],['﹞','[〕］）〉]',/[\]\)]/g],
	['﹝',/﹝﹝+/],['﹞',/﹞﹞+/],
	['《',/[‹«〈]/g],['》',/[〉»›]/g],

//	['‹',/〈/g],['›',/〉/g],
//	['«',/‹/g],['»',/›/g],

	['》《',/》[﹐﹑，、]+《/g],

	['\n','　','\t'],
	['「$1」',/\"([^"]*)\"/g],['『$1』',/\'([^']*)\'/g],
//	['\n\n', /\s\s+/g],
//	['',/^\s+/g],['\n',/\s+$/g],
	['\n\n',/\s+/g]
];


const notRenameT = [
	['﹨',/\\/],['／',/\//g],['﹕',/\:/],['。',/\./]
];


const encodingT = [
	'祈祈','福福','禮禮','神神','祉祉','祐祐','禍禍','祝祝','社社','祖祖','視視','禎禎','祥祥',
	'冷冷','聆聆','領領','令令','零零','憐怜','嶺嶺','羚羚','玲玲','鈴鈴','囹囹'
];


module.exports = {standardT, contextT, symbolT, notRenameT, sectionT, daoistDefT, daoistT, daoistTokenT, abcT, traAdjustT, policsT, correctOcrT, dotT, encodingT};

